[
    {
        "Job Title": "IT Project Manager",
        "Salary Estimate": -1,
        "Job Description": "If you are motivated to succeed and can see yourself in this role, please complete our application. We will follow up with you on the next steps in the interview process.\n\nOur associates are a strategic advantage for us who are making a difference at Littelfuse. Join our team and make a difference every day!\n\nCurrently we are looking for IT Project Manager reporting to the Global Head of IT PMO who will be responsible for supporting the IT-PMO and its day-today activities within this department to ensure programs and projects meet organization goals and requirements. Implements and provides guidance related to PMO processes and policies, oversees the work of project management for the Europe region, works with the IT leaders to define, prioritize and develop projects and programs (primarily in the Europe region but cross-over to other regions as needed).\n\nAbout the job:\nSupport global head of IT PMO in developing and defining best practices, processes, project management tools, and PMO templates.\nProvide project management support and guidance to the IT organization.\nMaintain a quality lens on the project management, requirements, documentation/analysis, and testing processes.\nProvide organizational change management support as projects are implemented.\nContinue to re-assess opportunities for project management process improvements.\nSupport IT department’s project portfolio management\nMaintain a high level of customer satisfaction with our internal business units.\nDevelops strong relationships with internal clients, IT management, IT technical staff and peers to define project goals, timelines and identifying and deploying resources to meet target completion dates.\nDevelop and maintain positive & effective relationships with the organization and Engage stakeholders across the organization to deliver results.\nAbout you:\nBachelor’s Degree required\nMust possess minimum 3 years of project management experience with strong knowledge and expertise in program/project management/systems development methodologies such as Agile, Waterfall, Six Sigma, and of SDLC, iterative and related methodologies.\nExperience in manufacturing and SAP.\nPrior experience working in a global environment.\nAbility to pull a diverse group of stakeholders with different goals together and facilitate productive discussions.\nAbility to work well within an environment of frequently changing priorities, adapt as needed, and develop a solution-oriented approach.\nAbility to communicate professionally & effectively to both technical and business teams, across all levels of the organization. Excellent presentation skills & comfort around senior leadership.\nStrong interpersonal skills and the ability to work cross-functionally with a variety of stakeholders and develop a solution-oriented approach.\nCommitment to company values.\nWe offer:\nThe opportunity to work in an international company with dynamic environment and develop professionally by expanding your knowledge though cross-functional, cross-cultural collaboration\nOpportunity to work part time from home office\nFull-time position with start date asap",
        "Rating": "3.8",
        "Company Name": "Littelfuse\n3.8",
        "Location": "Kaunas",
        "Headquarters": "Chicago, IL",
        "Size": "10000+ employees",
        "Founded": "1927",
        "Type of ownership": "Company - Public",
        "Industry": "Electrical & Electronic Manufacturing",
        "Sector": "Manufacturing",
        "Revenue": "$1 to $2 billion (USD)",
        "Competitors": -1,
        "Date: ": "16d",
        "URL": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=133666&s=58&guid=0000017168d710d5b4e1fc4c772c6bda&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&ea=1&cs=1_8f2bd603&cb=1586601857402&jobListingId=3475901938"
    },
    {
        "Job Title": "Junior Operations Officer (Night Shift, Part-Time position)",
        "Salary Estimate": -1,
        "Job Description": "Currently, we are looking for a highly motivated and dedicated person who is willing to learn and be a part of our Foreign Exchange and Money Market team. As a Junior Operations Officer, you will be responsible for mainly computer-related back-office tasks of simple-to-medium complexity, with some client-facing tasks. Your job includes various back-office services, such as data entry, data validation and customer support as you will be in contact with stakeholders from various countries – India, USA, Nordic countries etc.\n\nAs a Junior Operations Officer, you will be working in a team of about 17 employees. You will be cooperating with 2 other colleagues in the night shift between 11 p.m. and 4 a.m. on workdays (Monday-Friday).\nIn the first month we expect you to be able to come to the office during standard working hours for training purposes. After that, your will be working during night shift hours.\n*Your official title will be Officer – Service Delivery, Associate.\nMission:\n\nMonitoring Foreign Exchange (FX) / Continuous Linked Settlement (CLS) transactions\nMonitoring and approving trades, ensuring successful matching\nRegular communication with different stakeholders within the bank as well as external parties via phone and email\nInvestigation, analysis and problem solving\nMaintaining and improving quality in daily tasks, so that the client receives the best possible service\nSkills:\nAbility to work during night is a must\nInterest or experience in FX, money markets, finance and economics\nFluent English both in speaking and writing\nExcellent analytical skills and high level of accuracy and attention to details\nAbility to process large volumes of tasks and data\nCustomer focus, ability to learn quickly\nAbility to prioritize effectively, make decisions independently in a fast-changing environment without compromising quality\nWe will ensure that exact salary offered for you will be based on your qualifications, competencies, professional experience and requirements for the corresponding job function (salary range from 900 EUR to 1400 EUR gross EUR/monthly).\n\nWe care about your well-being and work-life balance, so we offer a whole package of benefits for you in addition! Check this out.\n\nIf you have any questions feel free to reach out to Evaldas Salkauskas, Hiring Manager on +370 673 84370\n\nSend application and CV no later than 27.04.2020.",
        "Rating": "3.6",
        "Company Name": "Danske Bank\n3.6",
        "Location": "Vilnius",
        "Headquarters": "Copenhagen, Denmark",
        "Size": "10000+ employees",
        "Founded": "1871",
        "Type of ownership": "Company - Public",
        "Industry": "Banks & Credit Unions",
        "Sector": "Finance",
        "Revenue": "$10+ billion (USD)",
        "Competitors": -1,
        "Date: ": "4d",
        "URL": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=4120&s=58&guid=0000017168d710d5b4e1fc4c772c6bda&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&cs=1_be315ea7&cb=1586601857403&jobListingId=3548109955"
    },
    {
        "Job Title": "Work from Home | Social Media Evaluator",
        "Salary Estimate": -1,
        "Job Description": "If you love social media and are an active user, now is the time to get paid for your time on social media platforms! Social Media Evaluators with Appen evaluate the quality and relevance of information in their local area or country of residence in categories such as news feeds, advertisements and search results. Tech companies around the world need the knowledge and experience of the very people who use their services. Social Media Evaluators have a direct impact on the effectiveness and relevancy of the service these companies provide.\nThe Social Media Evaluator is a work-from-home opportunity where all you need is a computer or smartphone and the desire to make a positive impact while working in the social media platforms you enjoy.\nThese are entry-level positions and Social Media Evaluators can learn new technologies and receive income just by having the experience of participating in social media.\nDon’t miss this opportunity to be part of a Appen’s rapidly growing global Social Media Evaluation services providing critical data for the world’s top internet search engine companies!\nWork Schedule:\n· Social Media Evaluator positions are flexible, part-time and only require between 1 and 4 hours a day with your choice of 5 to 7 days a week up to 20 hours a week!\nRequirements:\n· Must be currently residing in and able to perform work tasks in Lithuanian\n· Access to a computer or smart phone that is less than 3 years old\n· High-speed internet connection\n· Ability to read and write in English to understand and perform work tasks to customer specifications\nCharacteristics for Success:\n· Ability and desire to work from home doing internet-based work within social media platforms\n· Active user on social media platforms such as Facebook and Instagram\n· Good English spelling skills\n· Basic level of computer and/or smart phone operational knowledge\n· Ability and willingness to comprehend and follow instructions independently\n· Experience as a freelancer or other work-from-home opportunities\nCompensation:\n· Dependent upon project\nClick HERE to watch a short video to learn more about Social Media Evaluation.\nAppen Rewards and Recognition:\nFlexJobs – Recognized by FlexJobs as a Top 100 Company to Watch for Remote Jobs in 2014, 2015, 2016, 2017 including the #1 Ranking in 2017!\nDeloitte Technology Fast 50 – Three-time winner in the Deloitte Technology Fast 50 Australia Awards from 2012 through 2014.\nMomentum Mid-Market Awards – Finalist in the BRW Momentum Awards for Best Mid-Market Business $50-$100MM Category. In addition, Appen was a finalist in the 2014 Australian Growth Technology Company Awards.\nAustralian Export Rewards – Inaugural winner in 2008 of the Prime Minister’s Exporter of the Year Award and Australian Export Category winner, Information and Communication Technology Award.\nAppen’s clients are the top technology companies in the world. We are a global technology and language consulting firm, operating in 180 languages and we staff projects ranging in size from under one hundred to thousands of remote workers around the globe. Appen’s work provides the critical data our clients need to improve the technology experience in many platforms for all users.\nNote: Appen is actively hiring for many clients. We have other opportunities which may be contractor or employee status, or have different schedules and requirements. Our team will evaluate your application and review all positions that might be a quality fit based on your skills and experience. To see all our work opportunities, please visit join.appen.com.",
        "Rating": "3.5",
        "Company Name": "Appen\n3.5",
        "Location": "Vilnius",
        "Headquarters": "Sydney, Australia",
        "Size": "201 to 500 employees",
        "Founded": "1996",
        "Type of ownership": "Company - Public",
        "Industry": "Consulting",
        "Sector": "Business Services",
        "Revenue": "$50 to $100 million (USD)",
        "Competitors": -1,
        "Date: ": "23d",
        "URL": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=826481&s=58&guid=0000017168d710d5b4e1fc4c772c6bda&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&cs=1_a20da710&cb=1586601857404&jobListingId=2699369418"
    }
]