[
    {
        "Job Title": "Construction project's manager",
        "Salary Estimate": -1,
        "Job Description": "ABOUT US\n\nFAST INVEST was recognized by The Silicon Review among the Top 50 Fastest Growing Companies of the year 2019. Recently, the company started expanding into the real estate industry. So this is an excellent opportunity for a Construction Manager to join our team and use your technical skills and knowledge to contribute to the success of new projects in the market. FAST INVEST has an intention to inspire people and be always ready to pursue bigger goals.\n\nABOUT YOU\nYou do not come to work for the sake of just working. You are passionate about real estate and what you do. Willingness to approach projects with a can-do attitude and create a process where one does not exist. Comfortable in a fast-moving, fluid environment. Your previous experience with construction projects in Norway is very important for us.\n\nWHAT YOU'LL BE DOING\nEnsuring completion of all projects and tasks on time with a passion for accuracy, responsiveness, and in line with the foreseen budget.\nManaging multiple projects and tasks in an extremely fast-paced environment.\nSupporting all aspects of internal and external project coordination and communication.\nCommunicating with Norwegian institutions, architects and planning the most efficient way of the construction process.\nSearching for trustworthy and reliable construction subcontractors and negotiating with them.\nWorking with and foreign assigned contractors as well as internal departments ensuring delivery of accurate proposals and quotes.\nBuilding and maintaining strong relationships with partners in Lithuania and Norway by being honest and flexible at the first point of contact.\nAttending construction management meetings with potential and current contractors and following up on action items.\nManaging risks associated with all projects and tasks – ability to elevate risks through the appropriate channel.\n\nWHAT WE EXPECT FROM YOU\nPrevious experience with construction projects management in Norway. (SMILE SU SAUKTUKU(\nNative Norwegian and Good English language skills (written and oral).\nThorough knowledge of the constructional and architectural processes and materials.\nTo understand all unique Norwegian-specific requirements that are associated with real estate development.\nAbility to work with AutoCAD and BIM programs.\nAbility to travel and work from Lithuania’s office.\nDetail-oriented and strong organizational skills.\n\nPERSONAL SKILLS\nIndependent thinker who will take ownership of assignments.\nA team player soul looking for growth, both personal and business.\nAbility to communicate concisely and clearly.\nCuriosity!\n\nWE OFFER\nProfessional development budget.\nFlexible working hours and a special attention to work-life balance.\nA horizontal structure where everyone has a voice and makes a direct and valued contribution to building the best product possible.\nInternational team of open-minded people in a nice office environment.\nMany fun team events, office parties, and summer ‘weekend-getaway’ to spend some quality time with your colleagues.",
        "Rating": -1,
        "Company Name": "Fast Invest",
        "Location": "Kaunas",
        "Headquarters": "London, United Kingdom",
        "Size": "1 to 50 employees",
        "Founded": "2015",
        "Type of ownership": "Company - Private",
        "Industry": "Investment Banking & Asset Management",
        "Sector": "Finance",
        "Revenue": "$10 to $25 million (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Executive Assistant",
        "Salary Estimate": -1,
        "Job Description": "FAST INVEST is a P2P Investment platform where investing is made easy. Recently, our company was recognized by The Silicon Review among the Top 50 Fastest Growing Companies of the Year 2019. 545% growth of the investment volume, more than 33k customers from 55 countries .\nWe are committed to attracting and retaining the best team of talented professionals, and to create a better working culture where everyone can develop and use their best skills in the FinTech industry. By retaining leading talent anchored in a culture of integrity, we can operate according to our guiding principles and ensure excellent service and a healthy team environment.\n\nAbout the role:\nThis is an exciting opportunity for talented, motivated and relationships driven person to join Fintech world as CEO assistant. You will work closely with the team leader and you will support her with day-to-day tasks. So your primary role will be to assist, plan everything and be always ready to do something unpredictable. This role requires high flexibility and the ability to answer your phone 24/7.\n\nYour experience & skills:\nYou have a bachelor’s degree, preferably in finance-related fields.\nYou have experience working at Fintech or Tech company (it would be your superpower!).\nYou are very good at planning (ohh super good!).\nYou have excellent attention to detail.\nYou have perfect communication skills.\nYou are a team player with no ego.\nYour English is fluent (both written and verbal).\nYou are loyal, trustworthy and superrrrr confidential.\n\nKey responsibilities:\nSupport the CEO to ensure her diary management and execution, including arranging meals and ensuring everything is where it needs to be.\nCreating a list of tasks and priorities for the CEO.\nManage and maintain calendars.\nSchedule calls and meetings.\nManage a very busy inbox, highlight key emails, keep track of responses and any follow-ups required.\nParticipate in preparation for meetings, preparing papers and all required material.\nCoordinate all travel arrangements (flight check-in, transportation to and from the airport, hotel, etc.).\nHandle confidential information with integrity.\nDeliver the operating rhythm to the team.\nBuild strong relationships across the organization.‍\n\nYour superpowers:\nAlways ready for everything.\nSuperhero at planning.‍\nThere is not an impossible task for you.\nAbility to travel the world more than one time per month.\nYou can find solution in the situation when it looks like where is no solution at all.\nThinking and doing everything really fast.\nCan take care of everything and be everywhere.\nHaving an eye for stylish things and strong aesthetic.\n...We are not searching for an unicorn, but close to it.\n\nWe offer:\nPossibility to work with international projects and go across our offices in Europe.\nCompetitive salary and rewards based on achieved results.\nFancy offices in the Barcelona & Kaunas city center.\nMulticultural environment.\nGreat work-life balance culture.\nTeam events and much more\n\nAll candidates must be eligible to work in Kaunas.",
        "Rating": -1,
        "Company Name": "Fast Invest",
        "Location": "Kaunas",
        "Headquarters": "London, United Kingdom",
        "Size": "1 to 50 employees",
        "Founded": "2015",
        "Type of ownership": "Company - Private",
        "Industry": "Investment Banking & Asset Management",
        "Sector": "Finance",
        "Revenue": "$10 to $25 million (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Enterprise Lean Six Sigma Manager",
        "Salary Estimate": -1,
        "Job Description": "If you are motivated to succeed and can see yourself in this role, please complete our application. We will follow up with you on the next steps in the interview process.\n\nOur associates are a strategic advantage for us who are making a difference at Littelfuse. Join our team and make a difference every day!\n\nGrowing Lean team in Kaunas of 7 members, that works on Lean development have achieved great result and looking for Lean Manager to join Littelfuse.\n\nYou will be responsible for leading Lean methodology implementation based on Lean Roadmap also accountable for continuous improvement and efficiencies across the Company’s products, systems, operations and processes, to lead a team of people. You will work with the Management Team, develop, set the pace and implement business continuous improvement strategy with organizational structure, commercial approach, culture, people and processes.\n\nAbout the job:\nApply the Lean Principals to the major processes across the plant to identify and remove waste, improve operational performance and create an environment of continuous improvement\nContribute to new business initiatives and projects and review and communicate the impact on Lean activities\nWork collaboratively, negotiate and engage with key stakeholders to facilitate delivery and compliance with the Lean strategy\nDevelop key metrics to monitor progress during and after current state / future state implementation in order to insure favorable improvements are sustained\nDevelop and build a culture of engagement at all levels of the business to provide a highly energized team which is flexible to meet the changing needs of the business\nContribute to the creation and implementation of best practice Lean vision, strategy, policies, processes and procedures to aid and improve operational performance\nAbout you:\n3 to 5 years proven experience in LEAN environment\nLEAN or 6-Sigma knowledge with experience in the delivery of Lean Training programs\nExcellent leadership and people management skills\nAbility to work with a variety of cross-functional team members\nCompetence in problem solving, team building, planning and decision making\nDemonstrated high performance and commitment to continuous improvement\nFluency in English\nVery good MS Office skills\nBeneficial skills:\nGreen Belt or Black Belt certification\nWe offer:\nThe possibility to work in an exciting and challenging industry\nProfessional development opportunities to expand your knowledge through cross-functional collaboration and training experience",
        "Rating": "3.8",
        "Company Name": "Littelfuse\n3.8",
        "Location": "Kaunas",
        "Headquarters": "Chicago, IL",
        "Size": "10000+ employees",
        "Founded": "1927",
        "Type of ownership": "Company - Public",
        "Industry": "Electrical & Electronic Manufacturing",
        "Sector": "Manufacturing",
        "Revenue": "$1 to $2 billion (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Financial Operations Specialist",
        "Salary Estimate": -1,
        "Job Description": "At TransferGo we believe transferring money globally should be as simple and easy as sending a text. We aim to make life easier for anyone sending money by removing the processes and fees that traditional banks and cash bureaus have.\n\nWe are a fast growing FinTech company with an international team of almost 200 employees with offices in London, Vilnius, Kaunas, Berlin, Istanbul and Warsaw, a great product available on both web and mobile (NPS 76; 4.8/5* TrustPilot), plus reliable customer service available in 50+ countries and now we are looking into expanding our product and growing customer base across existing and new markets.\n\nHere’s what you’ll be doing:\nYou'll be responsible for executing transactions/processing refunds\nEnsuring timely and accurate transactions processing\nInvestigating and assisting team in solving problematic payments\nIndependently investigating and communicating issues with banks and counter parties\nPreparing information required by operational accounting and assisting in all matters\nWorking closely with the management and other operational departments on concerns and issues that arise in daily operations\nIdentifying any areas or processes of improvement\nAssisting team with the daily workflow and ad hoc tasks\nRequirements\n\nHere’s what we’d love from our new Financial Operations Specialist:\nDegree in Finance/Economics or related discipline\n1-2 years of experience in finance operations\nAbility to work on complex tasks with minimal supervision\nAbility to multitask and deliver high quality results that meet the identified targets\nStrong time management and attention to detail skills\nProfessional communication skills\nFluent and effective oral and written communication skills in English\nFlexibility to work in different shifts, according to business needs\nWhat we believe\n\nAt TransferGo, we do the work that matters, prioritising our customers above all else. But special treatment isn’t reserved just for customers – we go above and beyond to help our colleagues and our company succeed, too, building trust and being transparent all the way.\n\nWe take risks, learn from our mistakes and own what we do – and, by aspiring to be our best, we challenge ourselves to grow. This comes from knowledge-sharing and collaboration – and, of course, a hefty amount of fun!\n\nBenefits\nUnlimited paid holiday\nLatest equipment needed\nHighly skilled team members\nAccess and licenses to latest tools and technologies\nGuaranteed yearly training budget\nFriendly atmosphere and stimulating environment (pet friendly office, team events, snacks and drinks in the office, team buildings and events)\nPrivate health insurance (after 6 months of employment)\nMonthly salary from 1500 € to 1700 € (gross) depending on the level of experience.",
        "Rating": "4.7",
        "Company Name": "TransferGo\n4.7",
        "Location": "Vilnius",
        "Headquarters": "London, United Kingdom",
        "Size": "51 to 200 employees",
        "Founded": "2012",
        "Type of ownership": "Company - Private",
        "Industry": "Financial Transaction Processing",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "Manufacturing Process Engineer",
        "Salary Estimate": -1,
        "Job Description": "We Make Life More Rewarding and Dignified\n\nResponsibilities:\nEvaluate, implement and improve manufacturing processes by creating prototypes, testing, making modifications or by observation and throughput analysis\nDevelop new projects with including cost-benefit analysis to effectively utilize equipment and materials to maximize production by studying product requirements and testing manufacturing methods\nTroubleshoot process and production issues (e.g. production scrap), investigate problems and analyze root causes where these relate to production techniques that are used\nIdentify and lead Continuous Improvement Projects with emphasis on manufacturing cost reduction and capacity improvements/cycle time reductions.\nInspect performance of machinery, equipment, and tools to verify their efficiency, and investigate and initiate corrective action of problems and deficiencies to ensure product quality.\nPrepare product and process reports by collecting, analyzing, and summarizing information and trends.\nSupport Global Engineering Project / Process team to implement new equipment and upgrade projects\nRequirements:\nBachelor’s Degree in Engineering discipline, preferably Mechanical / Manufacturing Engineering or related field.\n3 years’ of working experience in manufacturing environment, to include experience with development of automated production equipment.\nFamiliarity with Equipment Control systems, PLC’s, FMEA and PFMEA.\nFamiliarity with DOE, validation, and statistical analysis tools.\nAbility to proactively identify and resolve engineering and manufacturing related issues.\nGood analytical and problem solving skills, as well as a keen attention to details.\nProject management, leadership and team work skills.\nEnglish and Lithuanian language required.\nCompany offers:\nProfessional development and career opportunities in new established manufacturing facility in Kaunas.\nOpportunity to become a part of a reputable company and join their unique culture.\nAttractive remuneration package.\nHollister is an Employee Owned employer\n\nApply Now!",
        "Rating": "3.7",
        "Company Name": "Hollister Incorporated\n3.7",
        "Location": "Kaunas",
        "Headquarters": "Libertyville, IL",
        "Size": "1001 to 5000 employees",
        "Founded": "1921",
        "Type of ownership": "Company - Private",
        "Industry": "Health Care Services & Hospitals",
        "Sector": "Health Care",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": "Coloplast, ConvaTec, Smith & Nephew"
    },
    {
        "Job Title": "Sales and Office administrator",
        "Salary Estimate": -1,
        "Job Description": "Pernod Ricard is the world’s leader in the Premium spirits industry. It operates in more than 85 affiliates and 100 production sites all over the world. Pernod Ricard Lithuania is a part of Pernod Ricard Northern Europe. The company focuses on 15 key wine and spirits brands such as ABSOLUT, Jameson, Havana Club and Jacob’s Creek.\n\nOverall responsibility:\nManagement and control of sales order processing – To control the process of getting Sales orders from customers, transferring them to 3PL, shipment of goods and invoicing.\nProviding customer services – provide assistance to PR Lithuania customers through the whole Selling process, from getting the order to delivering goods and issuing the invoice.\nManagement of daily office routines – to organise daily office routines such as post, office supplies, control of IT service request etc.\nAssistance to other departments - To establish and maintain good relationship with other Company’s departments and assist them upon request.\nRequirements:\nExcellent computer knowledge\nResponsibility, self-discipline, accuracy, capability to meet the deadlines\nSocial skills and cross-cultural awareness\nAbility to work in teams but also independently\nPlanning and organizing skills\n1-2-year work experience in relevant area is an advantage\nLithuanian– fluent\nEnglish -very good\nWe offer:\nOpen corporate culture and organization wide opportunities for professional growth;\nSalary 1300 -1400 Gross;\nInteresting and challenging work;\nInspiring and competent team.\nJob Posting End Date:\n\nTarget Hire Date:\n\n2020-04-01-07:00\n\nTarget End Date:",
        "Rating": "4.1",
        "Company Name": "Pernod Ricard\n4.1",
        "Location": "Vilnius",
        "Headquarters": "Paris, France",
        "Size": "10000+ employees",
        "Founded": "1975",
        "Type of ownership": "Company - Private",
        "Industry": "Food & Beverage Manufacturing",
        "Sector": "Manufacturing",
        "Revenue": "$5 to $10 billion (USD)",
        "Competitors": "Diageo, Bacardi, Brown-Forman"
    },
    {
        "Job Title": "Paid Internship in Vilnius (2-5 months)",
        "Salary Estimate": -1,
        "Job Description": "Early Careers at PMI\nBeing at the beginning of starting your professional career is exciting, yet not always easy. We know that, as we have been through this too.\nAt PMI, many of us started our journey as curious and ambitious interns, expecting to broaden our professional horizons, gain knowledge & skills, develop professional network & have opportunities for an international exposure. It’s the perfect setting place to start your career. Interested to hear more? Then read further…\n\nYour ‘day to day’\n\nYou will work on diverse, real-life situations and business projects. You will have a chance to master new skills, gain knowledge and new perspectives.\nWe offer opportunities within Digital, Marketing & Events and Legal functions.\n\nWho we’re looking for\n\nWe hope that you have passion for what really matters: consumers, innovation, people and results. You are curious to learn & discover every day and have eager to deliver. You are also:\n• A final year or recent University graduate.\n• Fluent in Lithuanian & English languages.\n• Have a valid Lithuanian work permit.\n\nWhat we offer\n\n• Employee centric, inspiring LEADERS, who will encourage you to make self-sufficient decisions, coach to reflect on different perceptions, guide in taking measurable risks and learn from your mistakes.\n• Flexible & inclusive ENVIRONMENT, development oriented CULTURE, cosy office and amazingly collaborative colleagues, who will treat you as a valuable member of the team, provide honest & structured feedback, so that you can have a chance to reach your full potential.\n• Prospect of making an IMPACT and deliver tangible business results, crediting with trust & supporting on the way, enabling to openly face FMCG sector trade realities & run real projects and business tasks.\n\nTo join our growing team apply until 12th April 2020 (preferably earlier).\n\nAll applications will be treated confidentially and screened on the on-going basis. The process consists of online tests, first round digital interviews, followed by face to face interviews with successful candidates.\nSalary for this role is 823 EUR gross.",
        "Rating": "3.7",
        "Company Name": "Philip Morris International\n3.7",
        "Location": "Vilnius",
        "Headquarters": "New York, NY",
        "Size": "10000+ employees",
        "Founded": "2008",
        "Type of ownership": "Company - Public",
        "Industry": "Consumer Products Manufacturing",
        "Sector": "Manufacturing",
        "Revenue": "$10+ billion (USD)",
        "Competitors": "British American Tobacco, Imperial Brands, Japan Tobacco International"
    },
    {
        "Job Title": "Lithuanian to English Translator",
        "Salary Estimate": -1,
        "Job Description": "Appen is an award-winning organization. Our people help leading technology companies expand into new global markets. With capability in over 180 languages, Appen’s global network of specialists and in-country virtual teams work together to ensure new products and technologies operate in all the languages our clients need. Whether our clients need help for in-vehicle speech recognition technology, improving search engine performance or building translation software, Appen delivers.\nWe are proud to have been named in Forbes Magazine as one of the Top 100 Companies Offering Flexible Jobs in 2014, 2015, 2016 and 2017.\nWe are looking for bilingual Lithuanian/English translators for an upcoming project.\nLocation: On-line\nEstimated weekly hours: 15-20 hours\nThe Project:\nThe data (700,000 Lithuanian source words) to be translated have been taken from various online news sources in Lithuanian.\nThe translated data from this project will be used as training data to develop a machine translation engine.Hence, accurately conveying the meaning of the source text and naturalness in US English is very important.\nRequirements:\nLithuanian and English native or near-native level speaker\nConfident with US spelling conventions\nVery good grammar and spelling skills in target language\nReliable Internet connection\nQualified candidates will be asked to complete a couple of tests.\nPreferred Skills:\nProfessional translation experience and/or degree in translation or linguistics (or related field).\nIf you or someone in your circle of friends meet the requirements and is interested in contributing to this project, apply now!\nDetailed project information and instructions will be provided shortly after you have enrolled.\nAppen constantly seeks motivated freelancers to support their translation, transcription, annotation and data collection teams. Your successful contribution to this project will grant you a space in our database and a good chance to be considered for projects in the future.\nWe are looking forward to receiving your application.",
        "Rating": "3.5",
        "Company Name": "Appen\n3.5",
        "Location": "Vilnius",
        "Headquarters": "Sydney, Australia",
        "Size": "201 to 500 employees",
        "Founded": "1996",
        "Type of ownership": "Company - Public",
        "Industry": "Consulting",
        "Sector": "Business Services",
        "Revenue": "$50 to $100 million (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Digital Engineer",
        "Salary Estimate": -1,
        "Job Description": "If you are motivated to succeed and can see yourself in this role, please complete our application. We will follow up with you on the next steps in the interview process.\n\nOur associates are a strategic advantage for us who are making a difference at Littelfuse. Join our team and make a difference every day!\n\nDigital Engineer\n\nGrowing Littelfuse Global IT, Analytics & Master Data department is looking for Digital Engineer to join newly formed team in Kaunas and accelerate Robotics Process Automation and Analytics cross-functionally, support business by providing the required capabilities of turning data into actionable insights and applying science to predict and model future outcomes. In this role you will collaborate with different business units to understand company needs and devise possible solutions.\n\nAbout the job:\nExtract information from various sources and analyze to understand how the business performs\nDesign, build, deploy and maintain Robotic Process Automations (RPA) with multi-application touch points\nPresent Artificial Intelligence (AI)/ Machine Learning (ML) outcomes to business via visualizations\nResearch and learn new and diverse set of technologies (RPA, Virtual Reality etc.) and identify potential use cases\nRunning machine learning tests and experiments, develop machine learning applications according to requirements\nAbout you:\nBachelor’s degree in information systems, programming, statistics, business analysis or other computer science curriculum course which includes quantitative analysis\nAt least 1 year of similar job experience\nExperience with Python/R is a must; experience with C#/.NET/Java is a plus\nWorking knowledge of Big Data, AI, ML technologies\nGood understanding of data ETL process\nHigh level of communication skills in English - written and verbal\nTeam player with ability to work in cross-cultural environment\nSelf-starter with strong learning capabilities and a data-oriented personality\nBeneficial skills:\nWorking experience with relational databases and NoSQL\nExperience with Tableau or MS- BI stack; developing, deploying and maintaining ML models and algorithms\nExperience with team collaboration tools such as Jira, GitHub, Confluence, or Microsoft Teams\nWe offer:\nSalary from 1350 eur/mon gross, excluding bonus based on performance. The final offer will depend on the experience and competencies of the selected candidate.\nThe possibility to drive innovations in a highly global, flexible and results-driven environment, within an exciting and challenging global function\nProfessional development opportunities to expand your knowledge through training and cross-functional collaboration",
        "Rating": "3.8",
        "Company Name": "Littelfuse\n3.8",
        "Location": "Kaunas",
        "Headquarters": "Chicago, IL",
        "Size": "10000+ employees",
        "Founded": "1927",
        "Type of ownership": "Company - Public",
        "Industry": "Electrical & Electronic Manufacturing",
        "Sector": "Manufacturing",
        "Revenue": "$1 to $2 billion (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Junior Brand Analyst",
        "Salary Estimate": -1,
        "Job Description": "A vacancy has arisen for a Junior Brand Analyst to be based at the Vilnius site in Lithuania.\n\nThe role of the Junior Brand Analyst (JBA) is an entry level position, ideal for someone looking to gain experience in the online protection space. The aim is to protect our global clientele from illegitimate activity on the Internet. Common abuses our clients face include: counterfeit goods, traffic diversion, misuse of trademark or copyright rights, and affiliate/channel partner compliance. The JBA works with international brand companies, using proprietary technology to detect and remove infringing content effectively and efficiently. This process includes analysis of large data sets, customization of workflow processes, proactive team collaboration, and generation of professional reports.\n\nThe main duties and responsibilities are:\nUse multiple technologies to detect, analyze, and remove infringing online content;\nCollaborate with clients and team members to implement and evolve customized approaches;\nCoordinate with international offices;\nGenerate standard and customized reports;\nFormulate and effectively communicate data-driven recommendations.\nThe minimum requirements for the role are:\nExcellent English skills, both verbal and written;\nStrong analytical and communication skills;\nDetail-oriented;\nMust be self-motivated, flexible, and adaptable to client & organizational changes;\nAbility to work independently with minimal supervision;\nExcellent time/deadline management skills;\nProficient in Excel and general computer skills.\nCore office hours are 9.00am to 6.00pm Monday to Friday.\nA full job profile is available from the HR Department. Candidates who feel they can meet the requirements should submit an up to date CV and covering letter for the attention Sarah-Jane Heaney to recruitmenteurope@opsecsecurity.com.\n\nClosing date: COB Tuesday 31st March 2020",
        "Rating": "2.5",
        "Company Name": "OpSec Security Group\n2.5",
        "Location": "Vilnius",
        "Headquarters": "Denver, CO",
        "Size": "51 to 200 employees",
        "Founded": "1983",
        "Type of ownership": "Company - Private",
        "Industry": "Security Services",
        "Sector": "Business Services",
        "Revenue": "$50 to $100 million (USD)",
        "Competitors": "Surys Group, MarkMonitor, J Patton Sports Marketing"
    },
    {
        "Job Title": "Customer Support Specialist (Ukrainian or Russian speaker)",
        "Salary Estimate": -1,
        "Job Description": "At TransferGo we are on a mission to make moving money globally as simple and easy as sending a text. We aim to make life easier for anyone sending money abroad by removing the processes and fees that traditional banking institutions have.\n\nWe are a fast-growing FinTech company with an international team of more than 170 employees, great product and service available in more than 50 countries, with the goal to provide the best customer service every step of the way.\n\nOur Customer Support Team:\n\nWe believe that our customers deserve the best, so even if they face any issue or just have a question, we’re always ready to help. Currently, our team provides support in 9 languages and consist of more than 40 very dynamic, super-friendly and passionate individuals.\n\nAt the moment we are looking for a highly motivated and bright Ukrainian or Russian speaker to join our wonderful Customer Support Team in Vilnius, Lithuania. If you are a dynamic problem solver who enjoys communicating and helping others, and you’re as passionate about positive customer experience as we are, you have to join us!\n\nRequirements\nExcellent verbal, written & listening skills in Ukrainian or Russian.\nDecent English for daily communication with the team and colleagues.\nPassion for excellent customer experience.\nAbility to master customer interactions, handle complaints and keep calm in stressful situations.\nAbility to multi-task and take responsibility & ownership in challenging situations.\nStrong attention to detail.\nAbility to work effectively in a team: a friendly, empathic and solution-oriented person.\nFlexibility to work in different shifts, according to business needs.\nWhat we believe\n\nAt TransferGo, we do the work that matters, prioritising our customers above all else. But special treatment isn’t reserved just for customers – we go above and beyond to help our colleagues and our company succeed, too, building trust and being transparent all the way.\n\nWe take risks, learn from our mistakes and own what we do – and, by aspiring to be our best, we challenge ourselves to grow. This comes from knowledge-sharing and collaboration – and, of course, a hefty amount of fun!\n\nBenefits\nBeing part of extremely exciting and growing Fintech startup community\nCompetitive salary package.\nUnlimited paid holidays.\nFlexible working hours with opportunity to work from home.\nOpportunity to learn with a company that is rapidly growing along with a guaranteed training budget of 1000 €.\nFriendly atmosphere and stimulating environment (pet friendly office, team events, snacks and drinks in the office, team buildings, fund budget and events).\nPrivate health insurance (after 6 months of employment).\nMonthly salary from 1100 € to 1800 € (gross) depending on the level of experience.\n\nCheck out more about us on Company Page, Careers Page and Glassdoor.",
        "Rating": "4.7",
        "Company Name": "TransferGo\n4.7",
        "Location": "Vilnius",
        "Headquarters": "London, United Kingdom",
        "Size": "51 to 200 employees",
        "Founded": "2012",
        "Type of ownership": "Company - Private",
        "Industry": "Financial Transaction Processing",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "Engineering Manager",
        "Salary Estimate": -1,
        "Job Description": "We’re looking for a battle-tested Engineering Manager to lead our product team and to help us keep growing.\n\nOur mission is to make moving money globally as simple as sending a text, by removing the processes and fees associated with traditional banking institutions. You’ll be joining a scale-up fintech company that has 140% YoY revenue growth, along with an international team of 170+ employees, a great product and a service that’s available in 50+ countries.\n\nAs an Engineering Manager, you’ll be managing, working with and coaching a team of experienced engineers, providing them with the context and tactical goals, architectural guidance, and day-to-day technical direction. You and your team will collaborate with business stakeholders to define product roadmap, goals and deliverables. Your work will directly impact the business day-to-day in tangible and visible ways. Your team will be fully owning a dedicated product domain, responsible for that end-to-end: full stack, full life-cycle.\n\nYour work will be a balanced mix of hands-on software engineering, team management, and research - you will have a lot of space to contribute yourself, and to keep your technical competency sharp.\n\nIf you're excited to be part of a winning team, to work on a purposeful “pain-killer” product, to sharpen your technical leadership skills, and to level-up towards senior engineering roles (tech co-founder, VPE, etc.), it is a perfect place to get ahead.\n\nYou’ll be reporting to VP Engineering.\n\nHere’s what you’ll be doing:\nLeading an autonomous cross-functional technical team to build and improve exciting Fintech products.\nWorking with other teams both within the engineering organization and outside of it, in order to get a better understanding of user needs and the impact of work the team does\nProviding context so team members can perform specific tasks\nHelping people on the team grow professionally ensuring everyone's voice is heard and a wide range of people can be successful\nHiring great coworkers to join the team\nRequirements\n\nHere’s what we’d love from our new Engineering Manager:\nExperience leading and guiding engineering teams (formally or informally; we care about your actual achievements, not titles)\nExperience designing, building and running distributed software systems\nRecent hands-on software engineering experience (this is a contributing manager role, you would need to get your hands dirty)\nA generalist rather than a specialist - you're excited by experimentation and unblocking anything that stands in the way of success\nA passion for efficiency and collaboration\nAnd if you can also do these things, even better:\nFinancial industry experience, especially in a startup, would be helpful in this role - but is not required\nWorking knowledge with our tech stack would be a benefit (or ability to learn and ramp-up quickly)\nHands-on experience building cloud-native applications and services (we are AWS house)\nHands-on experience with incremental delivery, continuous integration, continuous deployment, coding for automated testing\nWhat we believe\n\nAt TransferGo, we do the work that matters, prioritising our customers above all else. But special treatment isn’t reserved just for customers – we go above and beyond to help our colleagues and our company succeed, too, building trust and being transparent all the way.\n\nWe take risks, learn from our mistakes and own what we do – and, by aspiring to be our best, we challenge ourselves to grow. This comes from knowledge-sharing and collaboration – and, of course, a hefty amount of fun!\n\nBenefits\n\nSome of our best benefits are:\nCulture of trust, empowerment and constructive feedback\nExtensive onboarding, mentoring and personalized professional development towards your next role on the technical leadership path\nAwesome, highly skilled team members\nFlexible time / flexible location\nUnlimited paid holiday\nYearly training budget\nFriendly atmosphere and stimulating environment (pet friendly office, team events, snacks and drinks in the office, team buildings and events)\nPrivate health insurance (after 6 months of employment)\nMonthly salary from 4000 € (gross) depending on the level of experience.",
        "Rating": "4.7",
        "Company Name": "TransferGo\n4.7",
        "Location": "Vilnius",
        "Headquarters": "London, United Kingdom",
        "Size": "51 to 200 employees",
        "Founded": "2012",
        "Type of ownership": "Company - Private",
        "Industry": "Financial Transaction Processing",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "Language Specialist - Lithuanian",
        "Salary Estimate": -1,
        "Job Description": "Kviečiame lietuvių kalbos specialistą (-ę) prisijungti prie mūsų pasaulinės Booking.com turinio agentūros.\n\nBūsite atsakingi už Booking.com produktų (svetainės, programėlių, naujienlaiškių ir pan.) lietuviškos versijos kokybę bei komunikacijos turinį (televizijos reklamas, pranešimus spaudai ir kt.), skirtą įvairiems klientams mūsų versle.\n\nTikimės, kad jus ne tik domina kalbos ir lokalizavimo temos, bet jūs puikiai išmanote šią sritį, suprantate, ko reikia klientams, galite išlaikyti bei nuolat tobulinti mūsų produktų kokybę. Taip pat tikimės, kad stengiatės klientams teikti aukščiausius kokybės standartus atitinkančius produktus.\n\ni laikina (12 mėn.) darbo visą dieną pozicija siūloma mūsų biure Vilniuje.\n\nAtsakomybės\nLietuvos rinkai skirti patrauklūs ir kūrybiški svetainės bei rinkodaros turinio (taip pat naujienlaiškių) vertimai iš anglų į lietuvių kalbą\nLokalizavimo projektų įgyvendinimas kartu su kitomis kalbos specialistų komandomis ir įmonės departamentais\nLaisvai samdomų vertėjų darbo organizavimas ir pagalba jiems: kandidatų vertimų kokybės vertinimas, laisvai samdomų darbuotojų vertimų kokybės stebėsena, argumentuotų ir nuoseklių komentarų apie atliktus darbus pateikimas\nBooking.com sistemos lietuvių k. kokybės palaikymas atliekant svetainės patikrinimus, kuriant ir atnaujinant kalbos standartus apibrėžiančius įrankius (pavyzdžiui, glosarijų ir stiliaus gidą)\nPagalba įgyvendinant Booking.com B. V. paslaugų teikimo strategiją Lietuvoje\n\nReikalingi įgūdžiai\nAukštasis išsilavinimas susijusiose srityje\nNepriekaištingi lietuvių kalbos įgūdžiai (kalbėjimo ir rašymo), puikios anglų kalbos žinios\nVertimų ir (arba) lokalizuoto svetainės turinio, skirto Lietuvos rinkai, kūrimo patirtis\nSusitelkimas į kliento poreikius\nDarbo kompiuteriu įgūdžiai, įskaitant gebėjimą naudotis kompiuterio pagalba atliekamų vertimų įrankiais\nLankstumas, tikslumas, produktyvumas, patirtis dirbant su nustatytais užduočių terminais, prioritetizavimo ir analitiniai įgūdžiai, gebėjimas atlikti skirtingas užduotis vienu metu\nIniciatyvumas dirbant individualiai ir komandoje\nPozityvumas\nPatirtis kelionių technologijų ir (arba) viešbučių / turizmo srityje\nSocialinių tinklų turinio kūrimo, audiovizualinio lokalizavimo, Lietuvos rinkos tyrimų patirtis būtų laikoma privalumu.\nKą siūlome?\nDinamišką darbo aplinką ir kultūrą, kurioje vertinamas atvirumas, pažangios idėjos ir susitelkimas į darbo rezultatus.\nMokymus ir įvairias asmeninio tobulėjimo galimybes mūsų sparčiai augančioje įmonėje.",
        "Rating": "3.4",
        "Company Name": "Booking.com\n3.4",
        "Location": "Vilnius",
        "Headquarters": "Amsterdam, Netherlands",
        "Size": "10000+ employees",
        "Founded": "1996",
        "Type of ownership": "Company - Public",
        "Industry": "Internet",
        "Sector": "Information Technology",
        "Revenue": "$2 to $5 billion (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Support Associate",
        "Salary Estimate": -1,
        "Job Description": "Just 2 years ago, Wolt operated in 4 countries and 10 cities across the Nordics. Fast forward to today, we’re in 20 countries and over 80 cities across EMEA, servicing over 4M registered users. We’re growing rapidly and are looking for more talented individuals to join us. If you are passionate about cutting-edge technology, great food, and making an impact in your city, then Wolt just might be for you.\n\nAbout Wolt Lithuania’s operations\nThe role you are looking at is part of the Lithuania Operations Team of Wolt which is the heart and soul of Wolt Lithuania. Wolt is more than just a food delivery app - in fact we are a smooth operation built upon a solid foundation of state-of-the-art technology. We act as a real-time marketplace connecting customers, restaurants and courier partners. We collect a ton of data from multiple sources and make it actionable by tuning our operations. We want to make sure that we use all this data the best possible way, benefitting all our partners and customers.\n\nAbout the Role\nWe're currently looking for Support Associates to join us at our Vilnius office! In our Support Team there is no typical day, and to be successful in our Support Associate role you will need to be self-motivated, creative, have strong analytical skills, and excellent interpersonal and relationship-building skills to build strong communities of couriers, merchants and customers. As part of our team in Vilnius you’ll get to see all aspects of Wolt. Please note that the work is done in shifts.\nRole Focus\nCustomer Obsessed: At Wolt, our Community OPS team knows that customer interactions serve a larger purpose than simply fixing problems; our mission is to provide customers with an out of this world and memorable experience, every time.\nTeam Oriented: Work with a diverse team of fellow Support Associates and liaise with our other team members in Lithuania (and sometimes in other Baltic countries) to ensure a smooth sailing operations in Vilnius.\nCommunication: Fluidly and fluently communicate with our courier partners, customers, and merchants and adjust your tone to your audience.\nPersonal Touch: We’re not afraid to play up the playfulness in our interactions, so creativity is a must!\nGet stuff done: Hustle, hustle, hustle.\nYour Background\nYou're in the final stages of your university studies or a recent grad looking to get your feet wet in a fast-paced startup environment.\nYou already have experience in a customer-facing role under your belt and you're excited to join our Support OPS team where you genuinely want to improve Vilnius’ food & tech scene.\nYou are a fast learner & good at multitasking as customer communication may happen through many different channels simultaneously.\nYou are a bit of a tech savvy and quick learner when it comes to operating multiple digital communication and monitoring systems, without losing overview.\nYou're an expert when it comes to Vilnius’ food scene, traffic patterns, and the different residential and commercial districts.\nYou have a can-do attitude and enjoy the idea of working in a fast-paced startup environment.\nFluent in Lithuanian and able to work in English.\nYou are comfortable adjusting your tone to your audience.\nSo if you are excited about working in a high growth environment, taking ownership and being part of an extremely high performing team, we’d love to hear from you! We are reviewing applications on an on-going basis, so send through your application ASAP :)\n\nPlease submit your application in English!\n\nAbout Wolt\nWolt is a Finnish technology company and we’re best known for our food delivery platform. On our mobile app or website, customers can order their favorite meals from our restaurant partners, and either pick their order up or have it delivered by our courier partners.\n\nWe’re currently active in 20 countries and more than 80 cities, servicing over 4 million customers. Our apps (iOS and Android) have the industry’s highest reviews, largely because of our customer-centric approach to how we build our products and operations. For example, our customer service team responds in a matter of seconds, in the customer’s own language.\n\nWe’ve raised more than €150M in financing from renowned U.S. and European based investors, such as ICONIQ Capital, 83North, EQT Ventures and Highland Europe. We've also been fortunate enough to receive some appreciation and recognition for our hard work along the way: Apple selected Wolt’s app as their Editors' Choice, Wired named the company one of the \"Hottest Startups in Europe,\" Forbes included our CEO Miki Kuusi on its 30-under-30 in Consumer Tech list, and the Nordic Startup Awards named Wolt Company of the Year.",
        "Rating": "4.6",
        "Company Name": "Wolt\n4.6",
        "Location": "Vilnius",
        "Headquarters": "Helsinki, Finland",
        "Size": "501 to 1000 employees",
        "Founded": "2014",
        "Type of ownership": "Company - Private",
        "Industry": "Internet",
        "Sector": "Information Technology",
        "Revenue": "Less than $1 million (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Operatorius",
        "Salary Estimate": -1,
        "Job Description": "We Make Life More Rewarding and Dignified\n\nLocation: Kaunas\nDepartment: Operations\n\nDarbo pobūdis\nGamybos įrenginių valdymas, aptarnavimas ir priežiūra\nŽaliavų, reikalingų gamybos procesui, paruošimas (pagal instrukcijas)\nGaminamų produktų kokybės užtikrinimas, pagal nustatytus kokybės standartus\nGamybinės dokumentacijos pildymas\nDalyvavimas įrenginių remonto darbuose\nReikalavimai\nKruopštumas ir atsakingumas\nNoras mokytis ir tobulėti, bei dirbti komandoje\nKompiuterinis raštingumas\nGalimybė dirbti pamainomis\nAnglų kalbos žinios - privalumas\nPatirtis gamybinėje įmonėje – privalumas\nMes Jums siūlome\nNuoseklius profesinius mokymus darbo vietoje\nKarjeros augimo galimybes\nDarbą stabilioje tarptautinėje įmonėje\nHollister Incorporated is an independent, employee-owned company that develops, manufactures, and markets products for ostomy care, continence care, and wound care and develops educational support for patients and healthcare professionals. We have been in business for more than 95 years. Our products are sold in more than 90 countries and we have manufacturing and distribution centers on three continents. At Hollister Incorporated, we are passionate about the work we do, and we are committed to making life more rewarding and dignified for our Associates and for the people who use our products and services. A career at Hollister Incorporated can take many paths, all of them leading to rewarding opportunities.\n\nHollister is an EO employer - M/F/Veteran/Disability\n\nJob Req ID: 28176\n\nApply Now!",
        "Rating": "3.7",
        "Company Name": "Hollister Incorporated\n3.7",
        "Location": "Kaunas",
        "Headquarters": "Libertyville, IL",
        "Size": "1001 to 5000 employees",
        "Founded": "1921",
        "Type of ownership": "Company - Private",
        "Industry": "Health Care Services & Hospitals",
        "Sector": "Health Care",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": "Coloplast, ConvaTec, Smith & Nephew"
    },
    {
        "Job Title": "Paid Internship in Klaipėda (2-6 months)",
        "Salary Estimate": -1,
        "Job Description": "Early Careers at PMI\nBeing at the beginning of starting your professional career is exciting, yet not always easy. We know that, as we have been through this too.\nAt PMI, many of us started our journey as curious and ambitious interns, expecting to broaden our professional horizons, gain knowledge & skills, develop professional network & have opportunities for an international exposure. It’s the perfect setting place to start your career. Interested to hear more? Then read further…\n\nYour ‘day to day’\n\nYou will work on diverse, real-life situations and business projects. You will have a chance to master new skills, gain knowledge and new perspectives.\nWe offer opportunities within Continuous Improvement & Operations Training, Engineering, Production, Quality Assurance and Supply Chain functions.\n\nWho we’re looking for\n\nWe hope that you have passion for what really matters: consumers, innovation, people and results. You are curious to learn & discover every day and have eager to deliver. You are also:\n\n• A 3rd – 4th year bachelor or master studies student in Technological, Physical or Social sciences or recent University graduate.\n• Fluent in Lithuanian & English languages.\n• Advanced in MS Office packages (Excel & PowerPoint).\n• Have a valid Lithuanian work permit.\n\nWhat we offer\n\n• Employee centric, inspiring LEADERS, who will encourage you to make self-sufficient decisions, coach to reflect on different perceptions, guide in taking measurable risks and learn from your mistakes.\n• Flexible & inclusive ENVIRONMENT, development oriented CULTURE, cosy office and amazingly collaborative colleagues, who will treat you as a valuable member of the team, provide honest & structured feedback, so that you can have a chance to reach your full potential.\n• Prospect of making an IMPACT and deliver tangible business results, crediting with trust & supporting on the way, enabling to openly face FMCG sector trade realities & run real projects and business tasks.\n\nTo join our growing team apply until 12th April 2020 (preferably earlier).\n\nAll applications will be treated confidentially and screened on the on-going basis. The process consists of online tests, first round digital interviews, followed by face to face interviews with successful candidates.\n\nSalary for this role is 823 EUR gross.",
        "Rating": "3.7",
        "Company Name": "Philip Morris International\n3.7",
        "Location": "Klaipėda",
        "Headquarters": "New York, NY",
        "Size": "10000+ employees",
        "Founded": "2008",
        "Type of ownership": "Company - Public",
        "Industry": "Consumer Products Manufacturing",
        "Sector": "Manufacturing",
        "Revenue": "$10+ billion (USD)",
        "Competitors": "British American Tobacco, Imperial Brands, Japan Tobacco International"
    },
    {
        "Job Title": "Language Owner - Localisation",
        "Salary Estimate": -1,
        "Job Description": "ABOUT THE TEAM\nRevolut does Operations differently. The team sits at the core of Revolut, working with departments\nacross the business to help solve issues and create effective, scalable solutions.\nOperations has been responsible for major milestones like launching Premium and building our\nbanking infrastructure, as well as saving millions of pounds for the business.\nWorking in Operations at Revolut will give you exposure to a range of different verticals, where you\nwill deep dive into the fundamentals of each business area you work on. This gives you breadth and\ndepth of experience unrivalled in almost any other job and offers you the chance to have a huge\nimpact on Revolut’s success.\n\nABOUT THE ROLE\nIf you are one the rare masters of your native language, are detail oriented, always push for perfection, and you understand the importance of speaking to customers like humans, then we've got the perfect role for you. We're looking for a hands-on and passionate Language Owners to climb on board and take the lead and ownership of one or more of our supported languages across all platforms (Website, App, Coms , ...). We've built an incredible brand, and we are one of the fastest growing technology startups in the world as a result.\n\nTHE LOCALISATION TEAM\nOur Localisation team is responsible for translating all content into 28 different languages (and growing) on a daily basis. Whether it is for new product launches, communication or marketing, we strive for perfection with having one goal in mind, being the first truly Global Bank.\n\nWHAT YOU'LL BE DOING\n• Own and perform quality checks on the localised content of your assigned language(s), having a direct impact on thousands of customers.\n• Optimise the quality of the existing website, mobile app and communication content by designing a localisation framework and collaborating with our translating partners.\n• Work with the latest versions of the App/Website on a daily basis and ensuring that we deliver the most outstanding localised platforms among Fintech's.\n• Build efficient QC processes and we ensure that quality exceeds our customers’ standards\n\nWHAT YOU’LL NEED\n• NATIVE IN: French or Romanian or Polish (minimum requirement)\n• Fluent in English\n• Localisation, copywriting, or linguistic experience.\n• Writing creative and engaging content is your bread and butter (we're not corporate)\n• You are incredibly hands-on yet comfortable taking a step back and thinking strategically\n• You are naturally well organised and stay cool when working under tight deadlines\n• You are incredibly driven, hungry and learn from your mistakes\n• You believe in what we are doing and are truly passionate about disrupting finance\n• Native/Fluent in one of the following languages is a plus: Hungarian, Lithuanian, Greek, Czech, Russian, Swedish, Dutch, Bulgarian, Croatian, Latvian, Slovakian, Danish, Norwegian, Finnish, Turkish, Japanese, Chinese, Brazilian Portuguese.\n• Experience in working in tech companies and/or fast-paced environment is a plus.\n\n\n\n\nSalary circa 2000 Euros' per month. Negotiable on experience.\nA LITTLE ABOUT US\nWe believe that there are better ways for people to control their money. Easier, fairer ways.\nRevolut started in 2015 with card transactions abroad without rubbish exchange rates or hidden fees. We’ve since added business accounts, vaults, insurance and even access to cryptocurrency exposure.\nWe reached 10 million customers as we rolled into 2020 and we’re adding another million every quarter.\n\nWHAT WE ARE LOOKING FOR\nFrom employee 1 to employee 1400, you will be slotting into a global team that shares a number of traits.\nYou can work autonomously and take ownership. We thrive with the space and responsibility to solve problems.\nYou operate best without lots of bureaucracy. We don’t hide behind fancy job titles or clunky processes ‘because that’s how things are done’.\nYou approach work in a logical way. We are not afraid to make mistakes but we use data and logic to backup decisions and improve understanding.\nAnd you share our mission to improve people’s relationship with their money.\n\nTHE BENEFITS\n• Competitive salary\n• Biannual equity bonuses\n• All the latest tech you need\n• Skip the commute and work from home once a week\n• Roll with a free Revolut Metal subscription\n• Pension plan\n• Private health insurance\n\n\nPlease only submit an application for one posting.",
        "Rating": "3.8",
        "Company Name": "Revolut\n3.8",
        "Location": "Vilnius",
        "Headquarters": "London, United Kingdom",
        "Size": "1001 to 5000 employees",
        "Founded": "2015",
        "Type of ownership": "Company - Private",
        "Industry": "Financial Transaction Processing",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "GSGS Operations Assistant",
        "Salary Estimate": -1,
        "Job Description": "GSGS Operations Assistant\nLocation\n\n\nLithuania - Vilnius\n\nIRC Number\n\nIRC57485\n\n# of openings\n\n1\n\nApply Now\n\nOperation Assistant\n\nVilnius - Lithuania\n\nAbout Citco\n\nCitco is a global leader in fund services, corporate governance and related asset services with more than 7,000 staff across 80 offices worldwide. With more than $1 trillion in assets under administration, we deliver end-to-end solutions and exceptional service to meet our clients’ needs.\n\nAbout the Team & Business Line:\n\nFor over 75 years Citco has developed an ethos of service excellence and partnership in corporate fiduciary and administration that our clients rely upon. Through our global office network we provide a full suite of corporate administrative services to set up, administer and maintain corporate entities throughout their life cycle.\n\nWorking with our Global Subsidiary Governance Services team, you will work with multinationals, corporates and private clients to provide critical support that helps them meet the increasing regulatory and compliance requirements that shape the industry.\n\nYour Role:\nYou will prepare various statistical report\nYou will distribute Citco invoices to the clients\nYou will handle business partners invoices in complex situations\nYou will provide service to Operations team’s clients\nYou will perform various administrative complex assignments per requests of clients servicing teams\nAbout You:\nYou have college or university degree (can be fresh graduate or last year student available to work full-time)\nYou have very good computers skills (Microsoft Office packages)\nYou are fluent in English (written and spoken)\nYou are flexible, proactive and attentive to details team player with excellent communication skills\nOur Benefits\n\nYour wellbeing is of paramount importance to us, and central to our success. We provide a range of benefits, training and education support, and flexible working arrangements to help you achieve success in your career while balancing personal needs. Ask us about specific benefits in your location.",
        "Rating": "3.1",
        "Company Name": "Citco\n3.1",
        "Location": "Vilnius",
        "Headquarters": "George Town, Cayman Islands",
        "Size": "5001 to 10000 employees",
        "Founded": "1948",
        "Type of ownership": "Company - Private",
        "Industry": "Investment Banking & Asset Management",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": "State Street, MUFG, SS&C"
    },
    {
        "Job Title": "Data Engineer",
        "Salary Estimate": -1,
        "Job Description": "Who are we?\n\nTransferGo is an international fintech brand, offering online money transfers across the world with high speed, low fees and no hassle. We’re a multilingual bunch of people, working from offices in London, Vilnius, Kaunas, Berlin, Istanbul and Warsaw – and we’re still growing!\n\nAt TransferGo, we’re on a mission to make moving money globally as simple and easy as sending a text. Engineering team plays a critical role in shaping the way we create the best technical solutions and, to make sure we’re doing that in the best way possible, we’re now looking for a talented Data Engineer to work in our Infra team.\n\nYou’ll report to the Tech Lead.\n\nHere’s what you’ll be doing:\n\n\nContribute to building and fostering a data-centric culture across the whole company\nCreate and maintain optimal data architecture (covering operational data stores, data lake, data warehouse and data pipelines)\nIdentify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.\nBuild the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of relational/non-relational data sources\nContribute to building analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics.\nWork with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.\nCreate data tools for product analytics team members that assist them in building and optimizing our product into an innovative industry leader\nWork with data and analytics experts to strive for greater functionality in our data systems\nRequirements\n\nHere’s what we’d love from our new Data Engineer:\nAdvanced working knowledge and experience working with relational / non-relational data stores\nExperience designing, building and optimizing data pipelines and workflows\nHands-on scripting experience Python would be an advantage\nHands-on experience with AWS data-centric services (RDS, Redshift, Glue) would be an advantage\nExperience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement\nA track record of manipulating, processing and extracting value from large disconnected datasets\nExperience supporting and working with cross-functional teams in a dynamic environment\nWhat we believe\n\nAt TransferGo, we do the work that matters, prioritising our customers above all else. But special treatment isn’t reserved just for customers – we go above and beyond to help our colleagues and our company succeed, too, building trust and being transparent all the way.\n\nWe take risks, learn from our mistakes and own what we do – and, by aspiring to be our best, we challenge ourselves to grow. This comes from knowledge-sharing and collaboration – and, of course, a hefty amount of fun!\n\nBenefits\n\nSome of our best benefits are:\nBeing part of an exciting and growing fintech startup community\nA competitive salary package\nPrivate health insurance (after 6 months of employment)\nUnlimited paid holiday\nFlexible working hours, with the opportunity to work from home\nThe opportunity to learn with a company that is rapidly growing, along with a guaranteed training budget of €1,000\nA friendly atmosphere and stimulating environment (pet-friendly office, team events, tasty snacks and drinks in the office, team buildings, a fun budget and events)\nMonthly salary from 3000 € to 5000€ (gross) depending on the level of experience.",
        "Rating": "4.7",
        "Company Name": "TransferGo\n4.7",
        "Location": "Vilnius",
        "Headquarters": "London, United Kingdom",
        "Size": "51 to 200 employees",
        "Founded": "2012",
        "Type of ownership": "Company - Private",
        "Industry": "Financial Transaction Processing",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "User Experience Writer (English)",
        "Salary Estimate": -1,
        "Job Description": "Wix’s product storytellers. As passionate advocates for our users, we create clear, eye-level copy that shapes how people experience our products. Wix UX writers own the entire content process, and collaborate closely with product managers, UX designers and developers to create outstanding products. Guided by the Wix tone and voice, we craft compelling copy to get the right message across and help our users succeed.\n\nYou are:\n\nA native-level English speaker and writing professional with 2+ years’ relevant web experience. You’re passionate about creating simple, clear copy, as well as being tech savvy and up to date on trends in UX and web content. You’re highly organized and able to manage tasks independently, but you can also work effectively with a local and remote team.\n\nYou’re comfortable working in a fast-paced, dynamic environment, are a critical thinker and have an eye for detail. You can also travel occasionally, and love a good challenge (or 3)!\n\nAs a UX writer, you will:\nWrite clear, creative UX content in the Wix tone and voice.\nConduct extensive product research based on usability sessions, support tickets, competitor analysis and more.\nOwn every stage of the content cycle, from brainstorming on initial wireframes to shipping perfect copy.\nCollaborate with product managers, developers, UX designers and other stakeholders across the company and in different offices worldwide.\nJuggle multiple projects at once, while prioritizing your tasks and meeting tight deadlines.\nCoordinate the localization process for our global audience (18 languages and counting!).\nPlease send CV in English.\n\nResponsibilities\nResponsibilities\nRequirements / Minimum requirements\nRequirements",
        "Rating": "4.0",
        "Company Name": "Wix\n4.0",
        "Location": "Vilnius",
        "Headquarters": "Tel Aviv, Israel",
        "Size": "1001 to 5000 employees",
        "Founded": "2006",
        "Type of ownership": "Company - Public",
        "Industry": "Internet",
        "Sector": "Information Technology",
        "Revenue": "$500 million to $1 billion (USD)",
        "Competitors": "Weebly, Squarespace"
    },
    {
        "Job Title": "Intern, Software Engineering",
        "Salary Estimate": -1,
        "Job Description": "Company:\nBentley Systems\nAbout Bentley Systems\n\nBentley Systems is the leading global provider of software solutions to engineers, architects, geospatial professionals, constructors, and owner-operators for the design, construction, and operations of infrastructure, including public works, utilities, industrial plants, and digital cities. Bentley’s MicroStation-based open modeling applications, and its open simulation applications, accelerate design integration; its ProjectWise and SYNCHRO offerings accelerate project delivery; and its AssetWise offerings accelerate asset and network performance. Spanning infrastructure engineering, Bentley’s iTwin Services are fundamentally advancing BIM and GIS to 4D digital twins.\n\nBentley Systems employs more than 3,500 colleagues, generates annual revenues of $700 million in 170 countries, and has invested more than $1 billion in research, development, and acquisitions since 2014. From inception in 1984, the company has remained majority-owned by its five founding Bentley brothers.\n\nBentley Systems offer internships and permanent positions in our Vilnius and Kaunas offices.\n\nSoftware Engineer. Do you aspire to develop the smartest solutions using all your brains and the newest technologies? Do you have some experience writing code with C++, .Net or mobile technologies? If so, join our team of Software Engineers.\n\nIt is a great opportunity:\nYou will do real tasks in challenging projects and use the newest technologies;\nYou will have a personal mentor to support you;\nWe offer a flexible work schedule if you need to combine work and studies;\nThree-party agreement with University is not mandatory;\nWe pay salary to our interns;\nMost of interns stay at Bentley as permanent colleagues after their internships;\nMuch fun is also guaranteed!\nJob Segment:\nSoftware Engineer, Engineer, Construction, Geology, Entry Level Engineer, Engineering",
        "Rating": "3.6",
        "Company Name": "Bentley Systems\n3.6",
        "Location": "Kaunas",
        "Headquarters": "Exton, PA",
        "Size": "1001 to 5000 employees",
        "Founded": "1984",
        "Type of ownership": "Company - Private",
        "Industry": "Computer Hardware & Software",
        "Sector": "Information Technology",
        "Revenue": "$500 million to $1 billion (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Project Specialist 1",
        "Salary Estimate": -1,
        "Job Description": "The entry level position within Project Planning and Support Department. The key objective of this role is to proactively support Project Leader and Functional Leads in daily activities.\n\nThis will include:\n\n• Serve as liaison for Project Leader, Clinical Operations Leader and Data Operations Leader and team members.\n• Support organization of meetings including: meeting materials, presentations, binders, invitations, travel and room arrangements. Track and confirm investigator meeting attendees, distribute information about meetings to the study team.\n• Request project resources and control resource utilization.\n• Arrange and assist telephone conferences, client meetings, investigator meetings as appropriate.\n• Ensure an up-to-date team list is available in the central document repository including tracking of absences and vacation lists in the central document repository, if required.\n• Compose professional business correspondence on behalf of the Project Leader/ Clinical Operations Leader and Data Operations Leader. Print, copy, and fax and/or mail correspondence, reports, documents, etc.).\n• Assist in maintaining applicable systems according to data entry guidelines.\n• Assist team members with collecting and preparation of study specific documentation, customization of forms, add version-control as well as filing in the Electronic Documents Management System.\n• Request Study related supplies and arrange distribution.\n• Control team workload in the project.\n• Control of pass through costs invoices.\n• Complete routine administrative tasks in a timely and professional manner.\n\nQualifications\n• University degree (life science, advanced degree preferred).\n• Excellent interpersonal, verbal and written communication skills.\n• Fluent English.\n• Good knowledge of MS Office package with excellent working knowledge of Excel and Word.\n• Effective time management with the ability to prioritize workload and manage multiple, potentially conflicting deadlines with attention to detail and high quality of deliverables.\n• Ability to work in a fast-paced, continuously changing environment with a high degree of flexibility in adapting to emerging needs including working hours adaptation.\n• Ability to adhere to data confidentiality policy.\n• Ability to successfully work in a (virtual) team environment.\n• Ability to work independently with minimal supervision and function effectively as a team member.\n• Ability to liaise with senior management within both Parexel and client companies in a professional manner.",
        "Rating": "2.8",
        "Company Name": "Parexel\n2.8",
        "Location": "Vilnius",
        "Headquarters": "Newton, MA",
        "Size": "10000+ employees",
        "Founded": "1982",
        "Type of ownership": "Company - Private",
        "Industry": "Biotech & Pharmaceuticals",
        "Sector": "Biotech & Pharmaceuticals",
        "Revenue": "$2 to $5 billion (USD)",
        "Competitors": "PPD, IQVIA, PRA Health Sciences"
    },
    {
        "Job Title": "Product Designer",
        "Salary Estimate": -1,
        "Job Description": "TransferGo is an international fintech brand, offering online money transfers across the world with high speed, low fees and no hassle. We’re a multilingual bunch of people, working from offices in London, Vilnius, Kaunas, Berlin, Istanbul and Warsaw – and we’re still growing!\n\nAt TransferGo, we’re on a mission to make moving money globally as simple and easy as sending a text. Product designers play a critical role in shaping the way we craft user experiences and, to make sure we’re doing that in the best way possible, we’re now looking for a talented Product Designer to work in our UX/Product Design team.\n\nYou’ll report to the Head of UX.\n\nProduct Designer can expect to:\nDesign elegant, simple flows & interactions for our users across platforms.\nCollaborate with PMs, Engineers, User Researchers and Data to define problems & goals, map user flows, prototype and design interactions.\nSupport the design process by iterating and measuring design changes.\nContribute to and maintain a shared design system.\nIncorporate brand strategy and tone of voice into product designs.\nGive and solicit feedback from designers and cross-functional partners.\nExecute in a fast-paced start-up environment.\nRequirements\n\nWhat you’ll bring:\n2-5 years of consumer facing digital product design experience (web, app, social, chat).\nProven track record of producing quality work in a fast-paced environment.\nAbility to clearly articulate design decisions.\nAbility to build and organise design artefacts (flows, journey maps, wireframes, mocks, prototypes, specs, related documentation).\nFluency in Sketch, Figma, Adobe Photoshop, Illustrator, or other design tools.\nExcellent written and verbal communication skills.\nGood English language skills.\nWhat we believe\n\nAt TransferGo, we do the work that matters, prioritising our customers above all else. But special treatment isn’t reserved just for customers – we go above and beyond to help our colleagues and our company succeed, too, building trust and being transparent all the way.\n\nWe take risks, learn from our mistakes and own what we do – and, by aspiring to be our best, we challenge ourselves to grow. This comes from knowledge-sharing and collaboration – and, of course, a hefty amount of fun!\n\nBenefits\nUnlimited paid holiday.\nLatest equipment needed.\nHighly skilled team members.\nAccess and licenses to latest tools and technologies.\nGuaranteed yearly training budget.\nFriendly atmosphere and stimulating environment (pet friendly office, team events, snacks and drinks in the office, team buildings and events).\nPrivate health insurance (after 6 months of employment).\nMonthly salary from 2500 € to 4400 € (gross) depending on the level of experience.",
        "Rating": "4.7",
        "Company Name": "TransferGo\n4.7",
        "Location": "Vilnius",
        "Headquarters": "London, United Kingdom",
        "Size": "51 to 200 employees",
        "Founded": "2012",
        "Type of ownership": "Company - Private",
        "Industry": "Financial Transaction Processing",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "Administrative Assistant",
        "Salary Estimate": -1,
        "Job Description": "Administrative Assistant\nLocation\n\n\nLithuania - Vilnius\n\nIRC Number\n\nIRC56679\n\n# of openings\n\n1\n\nApply Now\n\nAdministrative Assistant\n\nVilnius-Lithuania\n\nAbout Citco\n\nCitco is a global leader in fund services, corporate governance and related asset services with more than 7,000 staff across 80 offices worldwide. With more than $1 trillion in assets under administration, we deliver end-to-end solutions and exceptional service to meet our clients’ needs.\n\nAbout the Team & Business Line:\n\nFund Administration is Citco’s core business, and our alternative asset and accounting service is one of the industry’s most respected. Our continuous investment in learning and technology solutions means our people are equipped to deliver a seamless client experience.\n\nAs a core member of our Fund Accounting team, you will be working with some of the industry’s most accomplished professionals to deliver award-winning services for complex fund structures that our clients can depend upon.\n\nYour Role:\nYou will intensively coordinate received documents and communicate with team members and managers;\nYou will assist in a daily office work with drafting various reports;\nYou will check, sort and upload client related documents into client and/or internal database following specific rules and instructions;\nYou will update internal database with up-to-date client information;\nAbout You:\nYou have college or University degree (can be fresh graduate or last year student available to work full-time);\nYou are accurate and result driven;\nYou have very good computer skills (Microsoft Office packages);\nYou are fluent English language (written and spoken).\nOur Benefits\n\nYour wellbeing is of paramount importance to us, and central to our success. We provide a range of benefits, training and education support, and flexible working arrangements to help you achieve success in your career while balancing personal needs. Ask us about specific benefits in your location.",
        "Rating": "3.1",
        "Company Name": "Citco\n3.1",
        "Location": "Vilnius",
        "Headquarters": "George Town, Cayman Islands",
        "Size": "5001 to 10000 employees",
        "Founded": "1948",
        "Type of ownership": "Company - Private",
        "Industry": "Investment Banking & Asset Management",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": "State Street, MUFG, SS&C"
    },
    {
        "Job Title": "Customer Service Specialist",
        "Salary Estimate": -1,
        "Job Description": "Main Responsibilities/Key Duties:\nProvide a high standard of customer service support to Thermo Fisher customers.\nDeal with complex customer requirements, efficiently and professionally as per the service level agreement.\nProcess different types of customers' orders with different systems following complex process path.\nManage the process for escalated inquiries and complaints to resolution, without managerial support.\nMaintain daily customer service reports.\nProvide expertise, guidance and support to colleagues.\nDevelop and deliver training materials to support departmental needs.\nOther duties as dictated by business need.\nSolve / escalate systems issues.\nIssue quotes according to existing standards.\nMaintain and create new customers accounts.\nAssess individual customer requirements and direct activities to appropriate departments.\nRequirements:\nUniversity education in life sciences (M.S. degree in biochemistry, organic chemistry, molecular biology, etc.).\nWork experience in customer service - required.\nWork experience with accounting programs.\nKnowledge of logistics processes.\nExcellent English language skills (oral and written).\nAbility to work in a team and independently, flexibility and initiative skills.\nThe company offers:\nThe innovative environment of the rapidly growing international company.\nBase salary (1200-1500 Eur bruto) and additional motivation package.\nAn exciting opportunity to be part of a dynamic global organization and work with experienced professionals.\nHigh performing, driven and supportive working culture and outstanding development possibilities to increase your potential.",
        "Rating": "3.4",
        "Company Name": "Thermo Fisher Scientific\n3.4",
        "Location": "Vilnius",
        "Headquarters": "Waltham, MA",
        "Size": "10000+ employees",
        "Founded": "1902",
        "Type of ownership": "Company - Public",
        "Industry": "Biotech & Pharmaceuticals",
        "Sector": "Biotech & Pharmaceuticals",
        "Revenue": "$10+ billion (USD)",
        "Competitors": "Illumina, Agilent Technologies, Roche"
    },
    {
        "Job Title": "Intern - Finance and customer service departments",
        "Salary Estimate": -1,
        "Job Description": "Intern - Finance and customer service departments\n\n\nVilnius\n\nReference No:\n15392\n\nWhat's the role?\n\nWe’re looking for an intern/ assistant who will ensure support for our finance and customer service departments.\n\nWho is Hilti?\n\nIf you’re new to the industry, you might not have heard of us. We provide leading-edge tools, technologies, software and services for the global construction sector. We have a proud heritage, built over 75 years, and a worldwide reputation for pioneering products and exceptional service.\n\nWith some 30,000 people in more than 120 countries, which we’re looking to expand, we’re a great place for you to show us your worth, step up to new challenges and grow your career.\n\nWhat does the role involve?\n\nYour areas of responsibility will be connected with documentation classification - system creation and document organization. You will perform balance confirmations and send reminders to customers. An important part of your job will be related to preparation and registration of customer cooperation agreements and support provision for Hilti Lithuania customer service department - arranging received invoices by folders and sending invoices to our customers.\n\nWe have more than 200,000 interactions with our customers every day. It’s how we get to know their businesses, understand their needs and develop the precise products and services that will help them.\n\nWhat do we offer?\n\nWe will provide you opportunity to develop during the internship and professional, dynamic and supportive colleagues.\n\nWhy should you apply?\n\nWe have an excellent mix of people, which we believe makes for a more vibrant, more innovative and more productive team.\n\nWhat you need is:\n\nAttention to details\nFluent Lithuanian, good English and/or Russian language knowledge\nEnthusiasm and orientation on achievement of goals and tasks assign\nPro-active engagement in the tasks to be performed\n\nTempted to apply or find out more - send your application.",
        "Rating": "3.8",
        "Company Name": "Hilti Group\n3.8",
        "Location": "Vilnius",
        "Headquarters": "Schaan, Liechtenstein",
        "Size": "10000+ employees",
        "Founded": "1941",
        "Type of ownership": "Company - Private",
        "Industry": "Construction",
        "Sector": "Construction, Repair & Maintenance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "Customer Service Representative",
        "Salary Estimate": -1,
        "Job Description": "Help Our Clients Succeed and We Will Do the Same for You.\nOur mission is to help IT buyers save time and money. We do this by making IT purchasing simple and transparent (read more)\nThis mission has stood the test of time for 15 years, unchanged.\nMarkit is a leading international company, offering IT purchasing solutions in 33 countries (and growing fast).\nHundreds of Fortune 500 and Forbes Global 2000 companies choose Markit as their IT purchasing partner.\nIn Lithuania we are seeking a Customer Service Representative to help take advantage of the growing opportunities in the Lithuanian market.\nWorking as a Customer Service Representative you will get the opportunity to learn more about IT purchasing and IT trends. This is a great starting point to move into an Account Manager position.\nRESPONSIBILITIES\nTo provide outstanding customer service to Markit customers in Lithuania\nTo look after our customer orders, inquiries and warranty cases\nTo communicate with our partners and customers to ensure smooth day-to-day operations.\nIDEAL CANDIDATE\nAt least 2 years of customer service experience\nSecondary or higher education\nNative Lithuanian language and good English language skills\nInterest in IT\nPositive attitude and desire to help\nAbility and willingness to work independently and within a team\nA desire to solve problems\nProactive attitude and attention to detail\nAre you ready for a rewarding challenge?\nJOIN 130 OTHER MARKITEERS\nTo innovate. To execute excellence. To make an impact. To celebrate. To be part of a forward thinking, professional and fun-loving team. A team that values honesty, openness, kindness, diversity and collaboration. Help us continue to lead the way in the world of IT purchasing.",
        "Rating": "4.9",
        "Company Name": "Markit\n4.9",
        "Location": "Vilnius",
        "Headquarters": "Tallinn, Estonia",
        "Size": "51 to 200 employees",
        "Founded": "2003",
        "Type of ownership": "Company - Private",
        "Industry": "Enterprise Software & Network Solutions",
        "Sector": "Information Technology",
        "Revenue": "$100 to $500 million (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Sourcing Specialist",
        "Salary Estimate": -1,
        "Job Description": "Darbo pobūdis:\nVykdo pirkimus ir valdo išlaidas tiekėjams, vadovaujantis Bendrovės išteklių taupymo, veiklos efektyvumo ir skaidrumo politika\nĮgyvendina taupymų projektus, siūlo idėjas naujiems projektams\nKuria ir įgyvendina tiekėjų valdymo strategiją siekiant gerinti tiekėjų pristatymą laiku (OTD, OTIF), ma*inti kokybės problemų, efektyvinti tiekėjų bazę\nBendrauja ir kuria santykius su tiekėjais grįstus verslo etika, pasitikėjimu ir savalaikiu grį*tamuoju ryšiu\nSprend*ia tiekėjų kainodaros, kokybės ar serviso problemas\nRengia ir vykdo pirkimų konkursus\nRengia derybų su tiekėjais strategiją ir vykdo derybas\nDerina ir pasirašo pirkimų/tiekimo sutartis su tiekėjais, atnaujina galiojančias sutartis\nBendradarbiauja su rinkodaros, operacijų, logistikos, finansų, kokybės u*tikrinimo ir mokslinių tyrimų bei plėtros padaliniais siekiant gerinti Bendrovės veiklos rodiklius\nRengia ataskaitas vadovybei pirkimų/tiekimo klausimais\nTvarkingai ir laiku rengia bei atitinkamai saugo pirkimų dokumentus\nReikalavimai:\nAukštasis universitetinis išsilavinimas (ekonomikos, finansų, verslo vadybos, procesų valdymo).\n2-3 metų darbo patirtis pirkimų/tiekimo pozicijoje\nPuikios IT sistemų *inios, įskaitant Microsoft Office', ERP sistemas\nPuikūs analitiniai įgūd*iai, gebėjimas analizuoti dideles duomenų apimtis, priimti sprendimus analize grįstus sprendimus\nGeri ryšių palaikymo (*od*iu ir raštu) ir asmeninio bendravimo įgūd*iai.\nPuikūs derybų įgūd*iai.\nPuikūs anglų kalbos *od*iu ir raštu įgūd*iai\nProjektų valdymo patirtis\nĮmonė siūlo:\nSparčiai augančios inovatyvios tarptautinės įmonės aplinką.\nKarjeros ir tobulėjimo galimybes.\nAtlygnimo rė*is nuo 1800 per/mėn (neatskaičius mokesčių)",
        "Rating": "3.4",
        "Company Name": "Thermo Fisher Scientific\n3.4",
        "Location": "Vilnius",
        "Headquarters": "Waltham, MA",
        "Size": "10000+ employees",
        "Founded": "1902",
        "Type of ownership": "Company - Public",
        "Industry": "Biotech & Pharmaceuticals",
        "Sector": "Biotech & Pharmaceuticals",
        "Revenue": "$10+ billion (USD)",
        "Competitors": "Illumina, Agilent Technologies, Roche"
    },
    {
        "Job Title": "Senior QA Engineer",
        "Salary Estimate": -1,
        "Job Description": "At TransferGo we are on a mission to make moving money globally as simple and easy as sending a text. We aim to make life easier for anyone sending money abroad by removing the processes and fees that traditional banking institutions have.\n\nWe are a fast-growing FinTech company with an international team of more than 170 employees, great product and service available in more than 50 countries, with the goal to provide the best customer service every step of the way.\n\nAt the moment we are offering an exciting opportunity for a Quality Assurance engineer to join our QA team and work for a well-known FinTech startup in our office in Vilnius. We operate in a high paced, collaborative and innovative environment where like-minded individuals come together to form great teams. If you have the talent and desire to learn and deliver then please get in touch with us.\n\nThe role:\n\nYou will be working within the technical department of the company running the latest products and features on some of the busiest and most successful consumer facing web and mobile apps the market has to offer. The team you will be joining is nimble and creative with the power to shape this company's technology and product roadmap and your input will shape testing. As Senior QA Engineer you will not just work with our product's test automation, but also work closely with our QA Guild and be able to shape our testing processes as well as touch the latest tech trends.\n\nAbout you:\n\nPassionate about trying and using trendy websites and apps\nExcellent communicator\nFluency in written and spoken English\nAbility to work autonomously\nAbility to automate boring stuff\nHigh levels of initiative\nPassion for Agility and working in an Agile environment\nMobile app native development awareness\nRequirements\n\nThe ideal candidate:\n3+ years of experience in software testing (both manual and automation)\nOur automation is built on Puppeteer/Cucumber/Appium/WebriverIO and NodeJS - we do not expect you to know all of this. Ability to learn fast is key.\nPassion for learning the latest and greatest QA methods\nKnowledge in any of the following programming languages JavaScript (NodeJS), Python, PHP would be an advantage\nKnowledge in any of the following: Selenium, Cucumber, Jenkins, Automated Testing\nPractical knowledge in: WEB/API/Mobile automation, Cucumber, CI/CD\nQuality focused, but have business acumen which enables pragmatism\nLikes a challenge, and enjoys working hard in a fun, casual working environment\nWhat we believe\n\nAt TransferGo, we do the work that matters, prioritising our customers above all else. But special treatment isn’t reserved just for customers – we go above and beyond to help our colleagues and our company succeed, too, building trust and being transparent all the way.\n\nWe take risks, learn from our mistakes and own what we do – and, by aspiring to be our best, we challenge ourselves to grow. This comes from knowledge-sharing and collaboration – and, of course, a hefty amount of fun!\n\nBenefits\n\nWe offer:\nBeing part of extremely exciting and growing Fintech startup community\nYou will spend 3 days per month learning and innovating.\nCompetitive salary package.\nPrivate health insurance (after 6 months of employment).\nUnlimited paid holiday.\nFlexible working hours with opportunity to work from home.\nOpportunity to learn with a company that is rapidly growing along with a guaranteed training budget of 1000 €.\nFriendly atmosphere and stimulating environment (pet friendly office, team events, snacks and drinks in the office, team buildings, fund budget and events).\nMonthly salary from 3000 € to 5000 € (brutto) depending on the level of experience.\n\nSounds like it’s you we’re looking for? We can't wait to meet you! Please contact our CTO directly by applying via the \"apply for this job\" button.",
        "Rating": "4.7",
        "Company Name": "TransferGo\n4.7",
        "Location": "Vilnius",
        "Headquarters": "London, United Kingdom",
        "Size": "51 to 200 employees",
        "Founded": "2012",
        "Type of ownership": "Company - Private",
        "Industry": "Financial Transaction Processing",
        "Sector": "Finance",
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "General Application",
        "Salary Estimate": -1,
        "Job Description": "General Application\n\n\nLooking for a new job? There are no current vacancies advertised at Essity that match your profile and interests?\n\nPlease click on the General Applications requisition to submit your CV and we will be in touch once a position becomes available, that we think might be suitable for your profile.\n\nIf you have seen a vacancy advertised on our site that you're keen to explore further, then please apply directly to the vacancy through our Careers Page.\n\nIn addition to submitting your CV to the General Applications requisition, we encourage you to create a job alert to receive an email when positions matching your interest become available.\n\nWho You Are\n\n\nWe are looking for people who embody our Beliefs & Behaviours, aren’t afraid to challenge, innovate, experiment and move at a fast pace. We are always looking for ways to improve our products and ourselves. If this is you, we’d love for you to apply!\n\nWhat We Can Offer You\n\nAt Essity, we believe every career is as unique as the individual and empower employees to reach their full potential in a winning culture motivated by a powerful purpose.\nCollaborative and caring Work Environment | Empowerment | Job Impact | Work with a Powerful Purpose | Individual Learning and Development | Health & Safety | Social Responsibility | Innovation\n\nLocation\n\n\nPlease note that if you are looking to send a General Application for a position in the USA or Russia, you will need to follow the General Application requisition for those 2 locations.\n\nTogether, we are improving lives, every day.\n\n\nWorking at Essity is not just a career; it is a chance to directly make the world a healthier, more hygienic and safer place. With impactful innovations coupled with sustainable solutions, we strive to reach more people every year with the necessary and essential solutions for well-being.",
        "Rating": "3.7",
        "Company Name": "Essity\n3.7",
        "Location": "Vilnius",
        "Headquarters": "Stockholm, Sweden",
        "Size": "10000+ employees",
        "Founded": "1929",
        "Type of ownership": "Company - Public",
        "Industry": "Consumer Products Manufacturing",
        "Sector": "Manufacturing",
        "Revenue": "$10+ billion (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "People & Business Partner",
        "Salary Estimate": -1,
        "Job Description": "HR Guild Life\n\n\nSweetness and Joy and Badass Hiring Skills\n\nThere’s only good vibe in the HR team, and we have the best reason for that. We are helping all applicants to find themselves in their dream roles. In the past year, we hired almost 500 amazing people! Shaping the Tesonet culture, organizing events, carrying out the craziest ideas and building winning teams – that’s what we are focused on.\n\nAs a People & Business Partner, you’ll be working with business leaders, managers, and teams to implement initiatives and programs to help people succeed.\n\nWhat You Will Do\nPartner with and advise managers on all employee-related issues;\nDevelop and manage full-cycle recruitment;\nSupport employees through all the different stages at Tesonet from onboarding events to off-boarding processes;\nHelp to design and implement other engagement and retention initiatives to increase organizational, team and individual performance.\nWhat We Expect\nPrevious work experience as an HR business partner or a similar role (in fast-growing technology companies is a plus);\nDemonstrable success in hiring at all levels of seniority;\nUnderstanding of research methods and analysis;\nAn analytical mind with problem-solving abilities;\nFriendly personality with a can-do attitude!\nStrong sense of urgency with the ability to handle multiple competing priorities;\nEmpathetic skills - ability to deal with different concerns and listen to people is highly valued here!\nWhat We Offer\nGreat conditions for work - flexible hours, separate workspaces for teams, no unnecessary distractions;\nTop-notch technologies and tools to work on world-renowned products;\nNeed to unwind? We have what you need: chill zone, F-1 simulator, table tennis, foosball, basketball, xbox, and more;\nProfessional in-house physiotherapist who will help you take care of your health;\nAlways fully stocked kitchen to fuel your productivity;\nProfessional growth opportunities (training courses of your choice, books, global conferences, business trips, etc.);\nAwesome team. Seriously - the best! We do regular internal events, knowledge sharing talks, team retreats & workation trips like nobody else;\nGross salary starting at 1800 EUR/month.\nBy filling in this form you agree with processing of your personal data by Tesonet. Provided data is processed for recruitment purposes. You can withdraw your consent to process personal data at any time. For more information on your rights and data processing please read our Privacy Policy.",
        "Rating": "4.6",
        "Company Name": "Tesonet\n4.6",
        "Location": "Vilnius",
        "Headquarters": "Vilnius, Lithuania",
        "Size": "501 to 1000 employees",
        "Founded": -1,
        "Type of ownership": "Company - Private",
        "Industry": -1,
        "Sector": -1,
        "Revenue": "Unknown / Non-Applicable",
        "Competitors": -1
    },
    {
        "Job Title": "Paid Summer Internship",
        "Salary Estimate": -1,
        "Job Description": "Paid Summer Internship\n\nCategory:\nDevelopment/Engineering\n\nCity:\nVilnius, Vilnius County, Lithuania\n\nPosition ID:\nJ0220-1918\n\nEmployment Type:\n\nFull Time\n\nPosition Description:\n\n\nWe are looking for Summer Interns to be part of our local and international team in Insurance Industry. We are offering:\nAll required trainings by our experienced colleagues\nProject simulation within international interns team\nFrequent feedback and lessons learned from our local colleagues\nPossibility to become Junior Developer / Junior Tester after intership\nPaid Internship\nFun things including leisure zone, lots of team building, knowledge sharing events on team and organizational level\nYour future duties and responsibilities:\n\n\n- Analysing requirements and translating business requirements into technical language\nDeveloping Insurance Core System enhancements\nTesting Insurance Core System enhancements\nPresenting results to your senior colleagues\nRequired qualifications to be successful in this role:\n\n\n- University student of IT or Mathematics\nGood logical & analytical thinking\nGreat communication skills\nWillingness to learn\nInterest in IT field\nFluent in English\nSkills:\n\n\nOracle\nSQL/PL SQL\n\nWhat you can expect from us:\n\n\nBuild your career with us.\n\nIt is an extraordinary time to be in business. As digital transformation continues to accelerate, CGI is at the center of this change—supporting our clients’ digital journeys and offering our professionals exciting career opportunities.\n\nAt CGI, our success comes from the talent and commitment of our professionals. As one team, we share the challenges and rewards that come from growing our company, which reinforces our culture of ownership. All of our professionals benefit from the value we collectively create.\n\nBe part of building one of the largest independent technology and business services firms in the world.\n\nLearn more about CGI at www.cgi.com.\n\nNo unsolicited agency referrals please.\n\nCGI is an equal opportunity employer.",
        "Rating": "3.5",
        "Company Name": "CGI\n3.5",
        "Location": "Vilnius",
        "Headquarters": "Montreal, Canada",
        "Size": "10000+ employees",
        "Founded": "1976",
        "Type of ownership": "Company - Public",
        "Industry": "Consulting",
        "Sector": "Business Services",
        "Revenue": "$10+ billion (USD)",
        "Competitors": "IBM, Accenture, Booz Allen Hamilton"
    },
    {
        "Job Title": "Accountant",
        "Salary Estimate": -1,
        "Job Description": "About Us\n\nFAST INVEST platform is a state of the art financial tool. Our engine helps society to build passive income streams and to achieve financial freedom in the short term. FAST INVEST has an intention to inspire people and be always ready to pursue bigger goals. The concept is based on the symbiosis of a responsible act, altruistic notion, and academic discipline. This particular harmony builds a broader context and awareness of our presence in our society. To be a part of the community is a unique inclusion, and it is something bigger than you alone. Responsible citizens of society - this is the key attribute of luxury.\n\nWorking Environment\n\nWe live to create a better working culture where everyone can develop and use their best skills. We are currently on a mission to find finance and data nerd, who would contribute towards our united goal to achieve even bigger results!\n\nAbout You\n\nYou do not come to work for the sake of just working. You are passionate about what you do. You live in a world of numbers and there can’t be enough to excel tables for you. Numbers do not bore you, it excites you, and most importantly – you can see past them.\n\nWhat you'll be doing ⚡️\nTo work at the intersection of technology to automate as much of finance as possible.\nTo support the Finance Manager in the coordination of the closure of accounts and production of the annual reports.\nAssisting with the statutory compliance for our Spanish entity, ensure accounts are filed in accordance with local compliance.\nReview the cash flow forecast on a monthly basis and monitor our cash flow weekly.\nEnsuring that all day to day accounting is carried out in an accurate and timely manner, including month-end postings, invoicing, payroll, VAT declarations.\n\nYour Professional Background\nGood knowing of statutory compliance of Lithuania.\nExperience working in Fintech or Tech company.\nExperience working with a large amount of data, building various reports.\nExperience with MySQL.\nExperience working with lending company portfolio/risk management would be considered as a plus.\n\nWe Offer\nProfessional development budget.\nPossibility to work with international projects and go across our offices in Europe.\nWork in a startup.\nA young and friendly team of colleagues of diverse nationalities, life experiences, family statuses.\nA horizontal structure where everyone has a voice and makes a direct and valued contribution to building the best product possible.\nMany fun team events, office parties, and summer ‘weekend-getaway’ to spend some quality time with your colleagues.\nFancy Office in Kaunas city center.",
        "Rating": -1,
        "Company Name": "Fast Invest",
        "Location": "Kaunas",
        "Headquarters": "London, United Kingdom",
        "Size": "1 to 50 employees",
        "Founded": "2015",
        "Type of ownership": "Company - Private",
        "Industry": "Investment Banking & Asset Management",
        "Sector": "Finance",
        "Revenue": "$10 to $25 million (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Head of Finance",
        "Salary Estimate": -1,
        "Job Description": "ABOUT US\nFAST INVEST is a P2P Investment platform where investing is made easy. Recently, our company was recognized by The Silicon Review among the Top 50 Fastest Growing Companies of the Year 2019. 545% growth of the investment volume, more than 41k customers from 55 countries.\nWe are committed to attracting and retaining the best team of talented professionals, and to create a better working culture where everyone can develop and use their best skills in the FinTech industry. By retaining leading talent anchored in a culture of integrity, we can operate according to our guiding principles and ensure excellent service and a healthy team environment.\n\nABOUT YOU\nYou do not come to work for the sake of just working. You are passionate about what you do. Effective strategic, operational, and leadership support to the team to ensure the highest standards of operational delivery. You feel comfortable in a fast-moving environment.\nYou will lead us through strategic financial planning and risk assessment, including periodic forecasts, reviews, and annual budgeting. As our Head of Finance, you will collaborate with our leadership team to advise on all financial matters.\n\nYOUR EXPERIENCE & SKILLS\nYou have a bachelor’s or master’s degree in finance or a related field.\nYou have experience working at Fintech or Tech company.\nA real enthusiasm for commercial, financial analysis, and an ability to develop KPI dashboards.\nExperience working within a senior finance position for a minimum of 3 years.\nHigh technology knowledge skills.\nYour English is fluent (both written and verbal).\nYou are loyal, trustworthy, and very confidential.\n\nKEY RESPONSIBILITIES\nWork autonomously and lead in an organization.\nTo build and develop modern, technology-based Financial Policies & Procedures.\nProduce comprehensive, technology-based financial models to identify risks & opportunities and track growth plans across the group.\nPartner with the CEO to bring the strategic vision of the business to life.\nTo build a technology-based system for cash flow control & financial risk management.\nTo comply with local financial regulations (UK, ES, LT, EE, PL) and excellent knowledge of IFRS.\nTo prepare reports for the financial regulator and other institutions.\n\nWE OFFER\nCreate the environment and process that enables highly effective teams to deliver the best that they can.\nWork in a Fintech with a growing customer base and an exciting product roadmap.\nInternational team of open-minded people in a nice office environment.\nFlexible working hours and a special attention to work-life balance.\nA friendly team of colleagues of diverse nationalities, life experiences and family statuses.\nA horizontal structure where everyone has a voice and makes a direct and valued contribution to building the best product possible.\nMany fun team events, office parties, and summer ‘weekend-getaway’ to spend some quality time with your colleagues.\nFancy office in Kaunas city center.",
        "Rating": -1,
        "Company Name": "Fast Invest",
        "Location": "Kaunas",
        "Headquarters": "London, United Kingdom",
        "Size": "1 to 50 employees",
        "Founded": "2015",
        "Type of ownership": "Company - Private",
        "Industry": "Investment Banking & Asset Management",
        "Sector": "Finance",
        "Revenue": "$10 to $25 million (USD)",
        "Competitors": -1
    },
    {
        "Job Title": "Mobile Development Internship",
        "Salary Estimate": -1,
        "Job Description": "Wix’s mobile team. We develop the Wix mobile app, enabling our users to manage their business from the convenience of their mobile phone, anytime and anywhere. We create fun, beautiful products that have a meaningful impact on millions of people around the world.\n\nWe are also a prominent player in the React Native community and have created many popular libraries and infrastructure tools for the React Native ecosystem.\n\nWe’re looking for a passionate team player to join our growing team.\n\nYou are:\nAn ambitious and creative student with a talent and passion for coding (mobile app development in particular).\nTeam player with a positive attitude\nPassionate about mobile applications and mobile development\nA tenacious self-starter and determined problem solver\nA student in your 2nd or 3rd year of studying computer science (or similar) at an accredited college or university.\nAble to work for at least 80 hours a month, with flexibility during exam periods. Ability to work full-time would be a bonus.\nBonus points if you have experience with:\nOpen source project development. Have a personal project to show us? That’s a big plus!\nReact and React Native\nAndroid/iOS development\nJavaScript frameworks\nAs a Mobile Developer, you will:\n\n\nWork with React Native code base\nManage and complete tasks using automated testing techniques, continuous integration and modern development processes.\nHandle fixes and develop new features for our mobile application.\nContinuously challenge your knowledge of how to scale mobile development.\n\nResponsibilities\nResponsibilities\nRequirements / Minimum requirements\nRequirements",
        "Rating": "4.0",
        "Company Name": "Wix\n4.0",
        "Location": "Vilnius",
        "Headquarters": "Tel Aviv, Israel",
        "Size": "1001 to 5000 employees",
        "Founded": "2006",
        "Type of ownership": "Company - Public",
        "Industry": "Internet",
        "Sector": "Information Technology",
        "Revenue": "$500 million to $1 billion (USD)",
        "Competitors": "Weebly, Squarespace"
    }
]