[
    {
        "Job Title": "Executive Assistant",
        "Salary Estimate": -1,
        "Job Description": "FAST INVEST is a P2P Investment platform where investing is made easy. Recently, our company was recognized by The Silicon Review among the Top 50 Fastest Growing Companies of the Year 2019. 545% growth of the investment volume, more than 33k customers from 55 countries .\nWe are committed to attracting and retaining the best team of talented professionals, and to create a better working culture where everyone can develop and use their best skills in the FinTech industry. By retaining leading talent anchored in a culture of integrity, we can operate according to our guiding principles and ensure excellent service and a healthy team environment.\n\nAbout the role:\nThis is an exciting opportunity for talented, motivated and relationships driven person to join Fintech world as CEO assistant. You will work closely with the team leader and you will support her with day-to-day tasks. So your primary role will be to assist, plan everything and be always ready to do something unpredictable. This role requires high flexibility and the ability to answer your phone 24/7.\n\nYour experience & skills:\nYou have a bachelor’s degree, preferably in finance-related fields.\nYou have experience working at Fintech or Tech company (it would be your superpower!).\nYou are very good at planning (ohh super good!).\nYou have excellent attention to detail.\nYou have perfect communication skills.\nYou are a team player with no ego.\nYour English is fluent (both written and verbal).\nYou are loyal, trustworthy and superrrrr confidential.\n\nKey responsibilities:\nSupport the CEO to ensure her diary management and execution, including arranging meals and ensuring everything is where it needs to be.\nCreating a list of tasks and priorities for the CEO.\nManage and maintain calendars.\nSchedule calls and meetings.\nManage a very busy inbox, highlight key emails, keep track of responses and any follow-ups required.\nParticipate in preparation for meetings, preparing papers and all required material.\nCoordinate all travel arrangements (flight check-in, transportation to and from the airport, hotel, etc.).\nHandle confidential information with integrity.\nDeliver the operating rhythm to the team.\nBuild strong relationships across the organization.‍\n\nYour superpowers:\nAlways ready for everything.\nSuperhero at planning.‍\nThere is not an impossible task for you.\nAbility to travel the world more than one time per month.\nYou can find solution in the situation when it looks like where is no solution at all.\nThinking and doing everything really fast.\nCan take care of everything and be everywhere.\nHaving an eye for stylish things and strong aesthetic.\n...We are not searching for an unicorn, but close to it.\n\nWe offer:\nPossibility to work with international projects and go across our offices in Europe.\nCompetitive salary and rewards based on achieved results.\nFancy offices in the Barcelona & Kaunas city center.\nMulticultural environment.\nGreat work-life balance culture.\nTeam events and much more\n\nAll candidates must be eligible to work in Kaunas.",
        "Rating": -1,
        "Company Name": "Fast Invest",
        "Location": "Kaunas",
        "Headquarters": "London, United Kingdom",
        "Size": "1 to 50 employees",
        "Founded": "2015",
        "Type of ownership": "Company - Private",
        "Industry": "Investment Banking & Asset Management",
        "Sector": "Finance",
        "Revenue": "$10 to $25 million (USD)",
        "Competitors": -1,
        "Date: ": "7d",
        "URL": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=936401&s=149&guid=0000017168dd97a6ab416a152564f4c7&src=GD_JOB_AD&t=SRFJ&extid=4&exst=L&ist=&ast=L&vt=w&slr=true&ea=1&cs=1_bd03ccc0&cb=1586602285181&jobListingId=3518375549"
    },
    {
        "Job Title": "Construction project's manager",
        "Salary Estimate": -1,
        "Job Description": "ABOUT US\n\nFAST INVEST was recognized by The Silicon Review among the Top 50 Fastest Growing Companies of the year 2019. Recently, the company started expanding into the real estate industry. So this is an excellent opportunity for a Construction Manager to join our team and use your technical skills and knowledge to contribute to the success of new projects in the market. FAST INVEST has an intention to inspire people and be always ready to pursue bigger goals.\n\nABOUT YOU\nYou do not come to work for the sake of just working. You are passionate about real estate and what you do. Willingness to approach projects with a can-do attitude and create a process where one does not exist. Comfortable in a fast-moving, fluid environment. Your previous experience with construction projects in Norway is very important for us.\n\nWHAT YOU'LL BE DOING\nEnsuring completion of all projects and tasks on time with a passion for accuracy, responsiveness, and in line with the foreseen budget.\nManaging multiple projects and tasks in an extremely fast-paced environment.\nSupporting all aspects of internal and external project coordination and communication.\nCommunicating with Norwegian institutions, architects and planning the most efficient way of the construction process.\nSearching for trustworthy and reliable construction subcontractors and negotiating with them.\nWorking with and foreign assigned contractors as well as internal departments ensuring delivery of accurate proposals and quotes.\nBuilding and maintaining strong relationships with partners in Lithuania and Norway by being honest and flexible at the first point of contact.\nAttending construction management meetings with potential and current contractors and following up on action items.\nManaging risks associated with all projects and tasks – ability to elevate risks through the appropriate channel.\n\nWHAT WE EXPECT FROM YOU\nPrevious experience with construction projects management in Norway. (SMILE SU SAUKTUKU(\nNative Norwegian and Good English language skills (written and oral).\nThorough knowledge of the constructional and architectural processes and materials.\nTo understand all unique Norwegian-specific requirements that are associated with real estate development.\nAbility to work with AutoCAD and BIM programs.\nAbility to travel and work from Lithuania’s office.\nDetail-oriented and strong organizational skills.\n\nPERSONAL SKILLS\nIndependent thinker who will take ownership of assignments.\nA team player soul looking for growth, both personal and business.\nAbility to communicate concisely and clearly.\nCuriosity!\n\nWE OFFER\nProfessional development budget.\nFlexible working hours and a special attention to work-life balance.\nA horizontal structure where everyone has a voice and makes a direct and valued contribution to building the best product possible.\nInternational team of open-minded people in a nice office environment.\nMany fun team events, office parties, and summer ‘weekend-getaway’ to spend some quality time with your colleagues.",
        "Rating": -1,
        "Company Name": "Fast Invest",
        "Location": "Kaunas",
        "Headquarters": "London, United Kingdom",
        "Size": "1 to 50 employees",
        "Founded": "2015",
        "Type of ownership": "Company - Private",
        "Industry": "Investment Banking & Asset Management",
        "Sector": "Finance",
        "Revenue": "$10 to $25 million (USD)",
        "Competitors": -1,
        "Date: ": "7d",
        "URL": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=936401&s=149&guid=0000017168dd97a6ab416a152564f4c7&src=GD_JOB_AD&t=SRFJ&extid=4&exst=L&ist=&ast=L&vt=w&slr=true&ea=1&cs=1_a1a498f5&cb=1586602285182&jobListingId=3518379543"
    }
]